# 1. pandas
## pandas의 특징
### pandas의 특징
* Numpy를 내부적으로 활용함(numpy의 특징을 그대로 가짐)
* 데이터 분석에 특화된 데이터 구조 제공
* 다양한 데이터 분석 함수 제공
* 데이터베이스에 쉽게 연결 가능
* json데이터나 table요소를 데이터프레임으로 손쉽게 변형 가능

In [1]:
# 설치
# !pip install pandas
# !conda install pandas

# 2. Pandas에서 다루는 데이터 타입

## 1) DataFrame: 2차원의 표 형식 데이터 => key:[value1,value2]

## 2) Series: 1차원의 벡터 형식 데이터 => list, tuple, ndarray

In [1]:
import pandas as pd

In [3]:
df = pd.DataFrame(
    {'이름':['홍길동', '장마철', '소나기', '더워요'],
     'Age': [23,55,24,16],
     '성별': ['male','female','female','male']    
    }
)

In [4]:
df

    이름  Age      성별
0  홍길동   23    male
1  장마철   55  female
2  소나기   24  female
3  더워요   16    male

In [8]:
print(type(df))

<class 'pandas.core.frame.DataFrame'>

In [11]:
type(df['이름'])

pandas.core.series.Series

In [12]:
type(df[['이름']])

pandas.core.frame.DataFrame

In [13]:
df['이름']

0    홍길동
1    장마철
2    소나기
3    더워요
Name: 이름, dtype: object

In [14]:
df[['이름']]

    이름
0  홍길동
1  장마철
2  소나기
3  더워요

In [15]:
df['이름'].ndim

1

In [16]:
df[['이름']].ndim

2

## 시리즈 만들기 pd.Series([리스트자료], name='컬럼명')
* 이름을 가지고 있는 벡터

In [3]:
ages = pd.Series([22,35,58], name='Age')
ages

0    22
1    35
2    58
Name: Age, dtype: int64

In [4]:
ages[1:]

1    35
2    58
Name: Age, dtype: int64

In [8]:
ages.min()

np.int64(22)

In [9]:
ages.max()

np.int64(58)

In [11]:
ages.describe()

count     3.000000
mean     38.333333
std      18.230012
min      22.000000
25%      28.500000
50%      35.000000
75%      46.500000
max      58.000000
Name: Age, dtype: float64

In [12]:
ages.mean()

np.float64(38.333333333333336)

# 판다스에서 자료 불러오기, 저장하기
* csv, tsv, excel, json, html
* pd.read_확장자

In [14]:
!pip install openpyxl

Collecting openpyxl
  Downloading openpyxl-3.1.5-py2.py3-none-any.whl.metadata (2.5 kB)
Collecting et-xmlfile (from openpyxl)
  Downloading et_xmlfile-1.1.0-py3-none-any.whl.metadata (1.8 kB)
Downloading openpyxl-3.1.5-py2.py3-none-any.whl (250 kB)
   ---------------------------------------- 0.0/250.9 kB ? eta -:--:--
   ---- ----------------------------------- 30.7/250.9 kB 1.4 MB/s eta 0:00:01
   ---------------------------------------- 250.9/250.9 kB 3.9 MB/s eta 0:00:00
Downloading et_xmlfile-1.1.0-py3-none-any.whl (4.7 kB)
Installing collected packages: et-xmlfile, openpyxl
Successfully installed et-xmlfile-1.1.0 openpyxl-3.1.5

In [15]:
df1 = pd.read_excel("./data/Online Retail.xlsx")
df1

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
...,...,...,...,...,...,...,...,...
541904,581587,22613,PACK OF 20 SPACEBOY NAPKINS,12,2011-12-09 12:50:00,0.85,12680.0,France
541905,581587,22899,CHILDREN'S APRON DOLLY GIRL,6,2011-12-09 12:50:00,2.10,12680.0,France
541906,581587,23254,CHILDRENS CUTLERY DOLLY GIRL,4,2011-12-09 12:50:00,4.15,12680.0,France
541907,581587,23255,CHILDRENS CUTLERY CIRCUS PARADE,4,2011-12-09 12:50:00,4.15,12680.0,France
541908,581587,22138,BAKING SET 9 PIECE RETROSPOT,3,2011-12-09 12:50:00,4.95,12680.0,France

In [18]:
df2 = pd.read_excel("./data/아파트(매매)_실거래가_20240806113828.xlsx", header=12, index_col='NO')
df2.head(13)

C:\Users\5-11\miniforge3\envs\fintech\lib\site-packages\openpyxl\styles\stylesheet.py:237: UserWarning: Workbook contains no default style, apply openpyxl's default
  warn("Workbook contains no default style, apply openpyxl's default")

,시군구,번지,본번,부번,단지명,전용면적(㎡),계약년월,계약일,거래금액(만원),동,층,매수자,매도자,건축년도,도로명,해제사유발생일,거래유형,중개사소재지,등기일자,주택유형
NO,,,,,,,,,,,,,,,,,,,,
1,서울특별시 영등포구 당산동5가,42,42,0,당산삼성래미안4차,115.7800,202407,31,"139,000",-,4,개인,개인,2003,당산로 214,-,직거래,-,-,아파트
2,강원특별자치도 원주시 지정면 가곡리,1512,1512,0,원주롯데캐슬골드파크1차(5단지),84.9644,202407,31,"38,900",-,10,개인,개인,2019,신지정로 250,20240802,중개거래,강원 원주시,-,아파트
3,대구광역시 달성군 화원읍 구라리,1650,1650,0,대곡역래미안,84.5958,202407,31,"29,500",-,11,개인,개인,2007,비슬로539길 35,-,중개거래,대구 달성군,-,아파트
4,광주광역시 남구 진월동,312-7,312,7,광명,70.6250,202407,31,"16,900",-,1,개인,개인,1998,광복마을길 63,-,중개거래,광주 남구,-,아파트
5,광주광역시 남구 진월동,331-93,331,93,중흥,84.8400,202407,31,"17,500",102,13,개인,개인,1992,서문대로749번마길 30,-,직거래,-,24.07.31,아파트
6,경기도 양평군 양평읍 양근리,140-5,140,5,양평현대,59.7000,202407,31,"22,500",-,14,개인,개인,1996,관문길 60,-,중개거래,경기 양평군,-,아파트
7,서울특별시 동대문구 장안동,587,587,0,동대문더퍼스트데시앙,59.8074,202407,31,"80,500",-,10,개인,개인,2019,장한로27가길 37,-,중개거래,서울 동대문구,-,아파트
8,대구광역시 달성군 화원읍 천내리,690-1,690,1,화원파크뷰우방아이유쉘,69.6413,202407,31,"38,000",-,17,개인,개인,2022,명천로21길 55,-,중개거래,대구 달서구,-,아파트
9,충청남도 천안시서북구 성거읍 신월리,2-26,2,26,천안삼환나우빌,84.9132,202407,31,"22,800",-,7,개인,개인,2005,봉주로 120,-,중개거래,충남 천안시서북구,-,아파트
10,경기도 양평군 양평읍 창대리,844,844,0,한화포레나양평,59.8551,202407,31,"31,500",-,19,개인,개인,2023,남북로 53,-,중개거래,경기 양평군,-,아파트
11,서울특별시 동대문구 용두동,39-446,39,446,용두아파트,47.5000,202407,31,"40,000",-,1,개인,개인,1974,고산자로32길 44,-,중개거래,서울 동대문구,-,아파트
12,서울특별시 서대문구 대현동,144,144,0,신촌럭키,83.3800,202407,31,"98,000",-,11,개인,개인,1999,이화여대길 50-12,-,중개거래,서울 서대문구,-,아파트
13,서울특별시 중랑구 면목동,193-1,193,1,면목한신,58.4600,202407,31,"54,500",-,7,개인,개인,1988,중랑천로 20,-,중개거래,서울 중랑구,-,아파트

## csv 파일 읽기
* pd.read_csv(파일명, 옵션들)

In [22]:
df3=pd.read_csv("./data/06고객이탈예측.csv", encoding='cp949')
df3

,회원ID,성별,고연령,배우자,피부양자,가입기간,전화서비스,2회선이상,인터넷서비스,온라인보안,...,기기보호서비스,기술지원,스트리밍TV,스트리밍Movies,약정옵션,온라인고지서,지불수단,월요금,합산요금,이탈여부
0,7590-VHVEG,Female,0,Yes,No,1,No,No phone service,DSL,No,...,No,No,No,No,Month-to-month,Yes,Electronic check,29.85,29.85,No
1,5575-GNVDE,Male,0,No,No,34,Yes,No,DSL,Yes,...,Yes,No,No,No,One year,No,Mailed check,56.95,1889.5,No
2,3668-QPYBK,Male,0,No,No,2,Yes,No,DSL,Yes,...,No,No,No,No,Month-to-month,Yes,Mailed check,53.85,108.15,Yes
3,7795-CFOCW,Male,0,No,No,45,No,No phone service,DSL,Yes,...,Yes,Yes,No,No,One year,No,Bank transfer (automatic),42.30,1840.75,No
4,9237-HQITU,Female,0,No,No,2,Yes,No,Fiber optic,No,...,No,No,No,No,Month-to-month,Yes,Electronic check,70.70,151.65,Yes
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
7038,6840-RESVB,Male,0,Yes,Yes,24,Yes,Yes,DSL,Yes,...,Yes,Yes,Yes,Yes,One year,Yes,Mailed check,84.80,1990.5,No
7039,2234-XADUH,Female,0,Yes,Yes,72,Yes,Yes,Fiber optic,No,...,Yes,No,Yes,Yes,One year,Yes,Credit card (automatic),103.20,7362.9,No
7040,4801-JZAZL,Female,0,Yes,Yes,11,No,No phone service,DSL,Yes,...,No,No,No,No,Month-to-month,Yes,Electronic check,29.60,346.45,No
7041,8361-LTMKD,Male,1,Yes,No,4,Yes,Yes,Fiber optic,No,...,No,No,No,No,Month-to-month,Yes,Mailed check,74.40,306.6,Yes
7042,3186-AJIEK,Male,0,No,No,66,Yes,No,Fiber optic,Yes,...,Yes,Yes,Yes,Yes,Two year,Yes,Bank transfer (automatic),105.65,6844.5,No

## json 파일 읽기
* pd.read_json

-----------------------------------------------------------------------------------------------------------------------

In [27]:
import os
from sqlalchemy import create_engine
import pymysql
from dotenv import load_dotenv
pymysql.install_as_MySQLdb()
load_dotenv(dotenv_path="../05data_scraping/.env_db")

True

In [30]:

engine = create_engine(f'{os.getenv("db")}+{os.getenv("dbtype")}://{os.getenv("id")}:{os.getenv("pw")}@{os.getenv("host")}/{os.getenv("database")}')
conn = engine.connect()
data_07 = pd.read_sql('2024_07_29_stock_company_info',con=conn)
data_08 = pd.read_sql('2024_08_05_stock_company_info',con=conn)
conn.close()

In [31]:
data_07

,증권종류,회사명,종목코드,업종,주요제품,상장일,결산월,대표자명,홈페이지,지역
0,유가증권,산일전기,062040,"전동기, 발전기 및 전기 변환 · 공급 · 제어 장치 제조업","유입, 몰드, 주상, 건식 변압기 등",2024-07-29,12월,박동석,http://www.sanil.co.kr,경기도
1,유가증권,에이치에스효성,487570,기타 금융업,지주사업,2024-07-29,12월,조현상..,http://www.hshyosung.com,서울특별시
2,"코스닥, 투자주의종목",엔에이치스팩31호,481890,금융 지원 서비스업,금융지원서비스업,2024-07-26,12월,이시형,,서울특별시
3,코스닥,SK증권제13호스팩,473950,금융 지원 서비스업,기업인수목적 주식회사,2024-07-25,12월,임율표,,서울특별시
4,코스닥,엑셀세라퓨틱스,373110,기초 의약물질 제조업,CellCor SFD/CD(세포배양배지),2024-07-15,12월,이의일,,서울특별시
...,...,...,...,...,...,...,...,...,...,...
415,코스닥,에이치브이엠,295310,1차 비철금속 제조업,"Ni계 합금, Fe계 합금, 스퍼터링타겟, Cu계 합금 등",2024-06-28,12월,문승호,http://hvm.co.kr/,경기도
416,코넥스,팡스카이,266350,소프트웨어 개발 및 공급업,게임 개발 및 리퍼블리싱,2024-06-28,12월,조호현..,http://www.panggame.com/,서울특별시
417,코스닥,하이젠알앤엠,160190,"전동기, 발전기 및 전기 변환 · 공급 · 제어 장치 제조업","전동기 및 발전기 (범용모터, 서보모터)",2024-06-27,12월,김재학,http://higenrnm.com,경상남도
418,코스닥,한국제15호스팩,479880,금융 지원 서비스업,기업인수합병,2024-06-26,12월,유한,,서울특별시
419,코스닥,에스오에스랩,464080,"측정, 시험, 항해, 제어 및 기타 정밀기기 제조업; 광학기기 제외",산업용 및 차량용 라이다(LiDAR),2024-06-25,12월,정지성,http://soslab.co,광주광역시

In [32]:
data_08

,증권종류,회사명,종목코드,업종,주요제품,상장일,결산월,대표자명,홈페이지,지역
0,코스닥,피앤에스미캐닉스,460940,의료용 기기 제조업,보행재활로봇 시스템,2024-07-31,12월,박광훈,http://walkbot.co.kr,서울특별시
1,유가증권,산일전기,062040,"전동기, 발전기 및 전기 변환 · 공급 · 제어 장치 제조업","유입, 몰드, 주상, 건식 변압기 등",2024-07-29,12월,박동석,http://www.sanil.co.kr,경기도
2,"유가증권, KRX300",에이치에스효성,487570,기타 금융업,지주사업,2024-07-29,12월,조현상..,http://www.hshyosung.com,서울특별시
3,코스닥,엔에이치스팩31호,481890,금융 지원 서비스업,금융지원서비스업,2024-07-26,12월,이시형,,서울특별시
4,코스닥,SK증권제13호스팩,473950,금융 지원 서비스업,기업인수목적 주식회사,2024-07-25,12월,임율표,,서울특별시
...,...,...,...,...,...,...,...,...,...,...
2701,"유가증권, KTOP30, KOSPI200, KRX300",유한양행,000100,의약품 제조업,"의약품(삐콤씨, 안티푸라민, 렉라자, 로수바미브, 코푸시럽 등), 생활용품(유한락스...",1962-11-01,12월,대표이..,http://www.yuhan.co.kr,서울특별시
2702,"유가증권, KOSPI200, KRX300",CJ대한통운,000120,도로 화물 운송업,"Contract Logistics, 포워딩, 항만하역, 해운, 택배국제특송, SCM...",1956-07-02,12월,신영수..,http://www.cjlogistics.com,서울특별시
2703,유가증권,경방,000050,종합 소매업,"섬유류(면사,면혼방사,면직물,면혼방직물,화섬사,화섬직물) 제조,도매,수출입",1956-03-03,12월,"김준,..",http://www.kyungbang.co.kr,서울특별시
2704,유가증권,유수홀딩스,000700,회사 본부 및 경영 컨설팅 서비스업,지주사업,1956-03-03,12월,송영규,http://www.eusu-holdings.com,서울특별시
2705,유가증권,한진중공업홀딩스,003480,연료용 가스 제조 및 배관공급업,지주회사,1956-03-03,12월,조남호..,http://www.hhic-holdings.com,경기도

In [33]:
df5=pd.read_json("./data/서울특별시_관광지입장정보_2011_2016.json")
df5

    ForNum  NatNum  addrCd gungu      resNm  rnum   sido  yyyymm
0    44722   75991    1111   종로구        창덕궁     1  서울특별시  201112
1        0   11017    1111   종로구        운현궁     2  서울특별시  201112
2   132399  237330    1111   종로구        경복궁     3  서울특별시  201112
3     3133   21267    1111   종로구        창경궁     4  서울특별시  201112
4    18226   24223    1111   종로구         종묘     5  서울특별시  201112
..     ...     ...     ...   ...        ...   ...    ...     ...
62    5588   44232    1141  서대문구  서대문형무소역사관     8  서울특별시  201512
63       0   22587    1141  서대문구  서대문자연사박물관     9  서울특별시  201512
64   29520    8822    1144   마포구    트릭아이미술관    10  서울특별시  201512
65       3    1647    1165   서초구      헌릉ㆍ인릉    11  서울특별시  201512
66     492   14454    1168   강남구      선릉·정릉    12  서울특별시  201512

[67 rows x 8 columns]

## mysql titanic DB에서 데이터 가져오기

In [2]:
import os
from sqlalchemy import create_engine
import pymysql
from dotenv import load_dotenv
pymysql.install_as_MySQLdb()
load_dotenv(dotenv_path="../05data_scraping/.env_db3")

True

In [3]:

engine = create_engine(f'{os.getenv("db")}+{os.getenv("dbtype")}://{os.getenv("id")}:{os.getenv("pw")}@{os.getenv("host")}/{os.getenv("database")}')
conn = engine.connect()
passenger = pd.read_sql('passenger',con=conn)
surv = pd.read_sql('surv',con=conn)
ticket = pd.read_sql('ticket',con=conn)

conn.close()

In [4]:
passenger

,PassengerId,Name,Sex,Age,SibSp,Parch
0,193,"Andersen-Jensen, Miss. Carla Christine Nielsine",female,19.0,1,0
1,192,"Carbines, Mr. William",male,19.0,0,0
2,715,"Greenberg, Mr. Samuel",male,52.0,0,0
3,533,"Elias, Mr. Joseph Jr",male,17.0,1,1
4,133,"Robins, Mrs. Alexander A (Grace Charity Laury)",female,47.0,1,0
...,...,...,...,...,...,...
618,580,"Jussila, Mr. Eiriik",male,32.0,0,0
619,503,"O'Sullivan, Miss. Bridget Mary",female,NaN,0,0
620,538,"LeRoy, Miss. Bertha",female,30.0,0,0
621,197,"Mernagh, Mr. Robert",male,NaN,0,0
622,176,"Klasen, Mr. Klas Albin",male,18.0,1,1

In [5]:
surv

     PassengerId  Survived
0            762         0
1            665         1
2            809         0
3            332         0
4             21         0
..           ...       ...
441          698         1
442          778         1
443          157         1
444          350         0
445          881         1

[446 rows x 2 columns]

In [6]:
ticket

     PassengerId         Ticket  Pclass      Fare    Cabin Embarked
0            486           4133       3   25.4667     None        S
1            119       PC 17558       1  247.5208  B58 B60        C
2            836       PC 17756       1   83.1583      E49        C
3            528       PC 17483       1  221.7792      C95        S
4            396         350052       3    7.7958     None        S
..           ...            ...     ...       ...      ...      ...
440          692         349256       3   13.4167     None        C
441          585           3411       3    8.7125     None        C
442          265         382649       3    7.7500     None        Q
443          328          28551       2   13.0000        D        S
444          136  SC/PARIS 2133       2   15.0458     None        C

[445 rows x 6 columns]

## 3개의 데이터프레임을 1개로 합치기 
* join()
* merge()
* concat()

In [7]:
test1=pd.concat([passenger, ticket, surv], keys='PassengerId')
test1.head()

C:\Users\5-11\AppData\Local\Temp\ipykernel_6992\3361158742.py:1: FutureWarning: The behavior of pd.concat with len(keys) != len(objs) is deprecated. In a future version this will raise instead of truncating to the smaller of the two sequences
  test1=pd.concat([passenger, ticket, surv], keys='PassengerId')

     PassengerId                                             Name     Sex  \
P 0          193  Andersen-Jensen, Miss. Carla Christine Nielsine  female
  1          192                            Carbines, Mr. William    male
  2          715                            Greenberg, Mr. Samuel    male
  3          533                             Elias, Mr. Joseph Jr    male
  4          133   Robins, Mrs. Alexander A (Grace Charity Laury)  female

      Age  SibSp  Parch Ticket  Pclass  Fare Cabin Embarked  Survived
P 0  19.0    1.0    0.0    NaN     NaN   NaN   NaN      NaN       NaN
  1  19.0    0.0    0.0    NaN     NaN   NaN   NaN      NaN       NaN
  2  52.0    0.0    0.0    NaN     NaN   NaN   NaN      NaN       NaN
  3  17.0    1.0    1.0    NaN     NaN   NaN   NaN      NaN       NaN
  4  47.0    1.0    0.0    NaN     NaN   NaN   NaN      NaN       NaN

In [8]:
test2=pd.merge(passenger,ticket, how='outer', on='PassengerId')
test2.head()

,PassengerId,Name,Sex,Age,SibSp,Parch,Ticket,Pclass,Fare,Cabin,Embarked
0,1,"Braund, Mr. Owen Harris",male,22.0,1.0,0.0,A/5 21171,3.0,7.250,None,S
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1.0,0.0,NaN,NaN,NaN,NaN,NaN
2,3,"Heikkinen, Miss. Laina",female,26.0,0.0,0.0,STON/O2. 3101282,3.0,7.925,None,S
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1.0,0.0,113803,1.0,53.100,C123,S
4,5,"Allen, Mr. William Henry",male,35.0,0.0,0.0,373450,3.0,8.050,None,S

In [9]:
test3=pd.merge(left=test2,right=surv, how='outer', on='PassengerId')
test3

,PassengerId,Name,Sex,Age,SibSp,Parch,Ticket,Pclass,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",male,22.0,1.0,0.0,A/5 21171,3.0,7.250,None,S,NaN
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1.0,0.0,NaN,NaN,NaN,NaN,NaN,1.0
2,3,"Heikkinen, Miss. Laina",female,26.0,0.0,0.0,STON/O2. 3101282,3.0,7.925,None,S,NaN
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1.0,0.0,113803,1.0,53.100,C123,S,NaN
4,5,"Allen, Mr. William Henry",male,35.0,0.0,0.0,373450,3.0,8.050,None,S,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,"Montvila, Rev. Juozas",male,27.0,0.0,0.0,211536,2.0,13.000,None,S,NaN
887,888,"Graham, Miss. Margaret Edith",female,19.0,0.0,0.0,112053,1.0,30.000,B42,S,NaN
888,889,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,0.0
889,890,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1.0
890,891,NaN,NaN,NaN,NaN,NaN,370376,3.0,7.750,None,Q,NaN

In [10]:
ticket=ticket.set_index('PassengerId')
ticket

                    Ticket  Pclass      Fare    Cabin Embarked
PassengerId
486                   4133       3   25.4667     None        S
119               PC 17558       1  247.5208  B58 B60        C
836               PC 17756       1   83.1583      E49        C
528               PC 17483       1  221.7792      C95        S
396                 350052       3    7.7958     None        S
...                    ...     ...       ...      ...      ...
692                 349256       3   13.4167     None        C
585                   3411       3    8.7125     None        C
265                 382649       3    7.7500     None        Q
328                  28551       2   13.0000        D        S
136          SC/PARIS 2133       2   15.0458     None        C

[445 rows x 5 columns]

In [11]:
passenger.join(ticket)

,PassengerId,Name,Sex,Age,SibSp,Parch,Ticket,Pclass,Fare,Cabin,Embarked
0,193,"Andersen-Jensen, Miss. Carla Christine Nielsine",female,19.0,1,0,NaN,NaN,NaN,NaN,NaN
1,192,"Carbines, Mr. William",male,19.0,0,0,A/5 21171,3.0,7.250,None,S
2,715,"Greenberg, Mr. Samuel",male,52.0,0,0,NaN,NaN,NaN,NaN,NaN
3,533,"Elias, Mr. Joseph Jr",male,17.0,1,1,STON/O2. 3101282,3.0,7.925,None,S
4,133,"Robins, Mrs. Alexander A (Grace Charity Laury)",female,47.0,1,0,113803,1.0,53.100,C123,S
...,...,...,...,...,...,...,...,...,...,...,...
618,580,"Jussila, Mr. Eiriik",male,32.0,0,0,A/5. 3336,3.0,16.100,None,S
619,503,"O'Sullivan, Miss. Bridget Mary",female,NaN,0,0,230136,2.0,39.000,F4,S
620,538,"LeRoy, Miss. Bertha",female,30.0,0,0,31028,2.0,10.500,None,S
621,197,"Mernagh, Mr. Robert",male,NaN,0,0,NaN,NaN,NaN,NaN,NaN
622,176,"Klasen, Mr. Klas Albin",male,18.0,1,1,NaN,NaN,NaN,NaN,NaN

In [12]:
data=pd.read_csv("https://raw.githubusercontent.com/haram4th/ablearn/main/Taitanic_train.csv")
data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

# 데이터프레임을 조회
* 앞쪽 5개 행을 읽는 head()
* 뒤쪽 5개 행을 읽는 tail()

In [25]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [27]:
data.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [ ]:
# head는 60을 넘어가면 자동축약

## 데이터의 타입(자료형)을 보고 싶을 때 .dtypes

In [28]:
data.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

# 데이터프레임의 컬럼명, 결측치, 데이터타입을 같이 표시 .info()

In [30]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

# 데이터프레임에서 숫자 데이터의 기초통계를 보는 함수.describe()

In [32]:
data.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

# 판다스에서 일부 자료만 추출하기

# 1)데이터프레임에서 1개 컬럼만 가져오기

In [34]:
data.head(1)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S

In [38]:
display(data['Name'])
print(type(data['Name']))

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: object

<class 'pandas.core.series.Series'>

## 2) 2개 이상의 컬럼 가져오기

In [44]:
data[['Name','Sex']]

                                                  Name     Sex
0                              Braund, Mr. Owen Harris    male
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female
2                               Heikkinen, Miss. Laina  female
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female
4                             Allen, Mr. William Henry    male
..                                                 ...     ...
886                              Montvila, Rev. Juozas    male
887                       Graham, Miss. Margaret Edith  female
888           Johnston, Miss. Catherine Helen "Carrie"  female
889                              Behr, Mr. Karl Howell    male
890                                Dooley, Mr. Patrick    male

[891 rows x 2 columns]

In [45]:
data[['Name','Sex','Pclass']]

                                                  Name     Sex  Pclass
0                              Braund, Mr. Owen Harris    male       3
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female       1
2                               Heikkinen, Miss. Laina  female       3
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female       1
4                             Allen, Mr. William Henry    male       3
..                                                 ...     ...     ...
886                              Montvila, Rev. Juozas    male       2
887                       Graham, Miss. Margaret Edith  female       1
888           Johnston, Miss. Catherine Helen "Carrie"  female       3
889                              Behr, Mr. Karl Howell    male       1
890                                Dooley, Mr. Patrick    male       3

[891 rows x 3 columns]

# 데이터프레임 컬럼 순서바꾸기

In [13]:
data = data[['PassengerId','Pclass','Ticket','Name','Sex','Age','SibSp','Parch','Fare','Cabin','Embarked','Survived']]
data

,PassengerId,Pclass,Ticket,Name,Sex,Age,SibSp,Parch,Fare,Cabin,Embarked,Survived
0,1,3,A/5 21171,"Braund, Mr. Owen Harris",male,22.0,1,0,7.2500,NaN,S,0
1,2,1,PC 17599,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,71.2833,C85,C,1
2,3,3,STON/O2. 3101282,"Heikkinen, Miss. Laina",female,26.0,0,0,7.9250,NaN,S,1
3,4,1,113803,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,53.1000,C123,S,1
4,5,3,373450,"Allen, Mr. William Henry",male,35.0,0,0,8.0500,NaN,S,0
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,2,211536,"Montvila, Rev. Juozas",male,27.0,0,0,13.0000,NaN,S,0
887,888,1,112053,"Graham, Miss. Margaret Edith",female,19.0,0,0,30.0000,B42,S,1
888,889,3,W./C. 6607,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,23.4500,NaN,S,0
889,890,1,111369,"Behr, Mr. Karl Howell",male,26.0,0,0,30.0000,C148,C,1
890,891,3,370376,"Dooley, Mr. Patrick",male,32.0,0,0,7.7500,NaN,Q,0

## 데이터프레임에서 일부 컬럼만 가져오기2
* loc: 인덱스이름과 컬럼명으로 일부를 추출해서 가져옴
* iloc: 슬라이싱을 이용해서 가져옴

In [49]:
data.loc[100:130,['Ticket','Name']]

                Ticket                               Name
100             349245            Petranec, Miss. Matilda
101             349215   Petroff, Mr. Pastcho ("Pentcho")
102              35281          White, Mr. Richard Frasar
103               7540         Johansson, Mr. Gustaf Joel
104            3101276     Gustafsson, Mr. Anders Vilhelm
105             349207              Mionoff, Mr. Stoytcho
106             343120   Salkjelsvik, Miss. Anna Kristine
107             312991             Moss, Mr. Albert Johan
108             349249                    Rekic, Mr. Tido
109             371110                Moran, Miss. Bertha
110             110465     Porter, Mr. Walter Chamberlain
111               2665               Zabour, Miss. Hileni
112             324669             Barton, Mr. David John
113               4136            Jussila, Miss. Katriina
114               2627              Attalah, Miss. Malake
115  STON/O 2. 3101294              Pekoniemi, Mr. Edvard
116             370369               Connors, Mr. Patrick
117              11668    Turpin, Mr. William John Robert
118           PC 17558           Baxter, Mr. Quigg Edmond
119             347082  Andersson, Miss. Ellis Anna Maria
120       S.O.C. 14879        Hickman, Mr. Stanley George
121          A4. 54510         Moore, Mr. Leonard Charles
122             237736               Nasser, Mr. Nicholas
123              27267                Webber, Miss. Susan
124              35281        White, Mr. Percival Wayland
125               2651       Nicola-Yarred, Master. Elias
126             370372                McMahon, Mr. Martin
127            C 17369          Madsen, Mr. Fridtjof Arne
128               2668                  Peter, Miss. Anna
129             347061                 Ekstrom, Mr. Johan
130             349241               Drazenoic, Mr. Jozef

In [50]:
data.iloc[10:20,4:8]

    Pclass     Sex  SibSp  Parch
10       3  female      1      1
11       1  female      0      0
12       3    male      0      0
13       3    male      1      5
14       3  female      0      0
15       2  female      0      0
16       3    male      4      1
17       2    male      0      0
18       3  female      1      0
19       3  female      0      0

In [51]:
data.iloc[:20:2,::-1]

,Embarked,Cabin,Fare,Ticket,Parch,SibSp,Sex,Pclass,Age,Name,Survived,PassengerId
0,S,NaN,7.2500,A/5 21171,0,1,male,3,22.0,"Braund, Mr. Owen Harris",0,1
2,S,NaN,7.9250,STON/O2. 3101282,0,0,female,3,26.0,"Heikkinen, Miss. Laina",1,3
4,S,NaN,8.0500,373450,0,0,male,3,35.0,"Allen, Mr. William Henry",0,5
6,S,E46,51.8625,17463,0,0,male,1,54.0,"McCarthy, Mr. Timothy J",0,7
8,S,NaN,11.1333,347742,2,0,female,3,27.0,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",1,9
10,S,G6,16.7000,PP 9549,1,1,female,3,4.0,"Sandstrom, Miss. Marguerite Rut",1,11
12,S,NaN,8.0500,A/5. 2151,0,0,male,3,20.0,"Saundercock, Mr. William Henry",0,13
14,S,NaN,7.8542,350406,0,0,female,3,14.0,"Vestrom, Miss. Hulda Amanda Adolfina",0,15
16,Q,NaN,29.1250,382652,1,4,male,3,2.0,"Rice, Master. Eugene",0,17
18,S,NaN,18.0000,345763,0,1,female,3,31.0,"Vander Planke, Mrs. Julius (Emelia Maria Vande...",0,19

# 특정 컬럼에서 유일값 요소 출력하기 .unique()

In [52]:
data['Embarked'].unique()

array(['S', 'C', 'Q', nan], dtype=object)

# 특정 컬럼에서 유일값 개수 출력하기 .nunique()

In [53]:
data['Embarked'].nunique()

3

# 카테고리 컬럼에서 유일값 별 개수를 세는 함수 value_counts()

In [54]:
data['Pclass'].value_counts()

Pclass
3    491
1    216
2    184
Name: count, dtype: int64

In [55]:
data['Age'].value_counts()

Age
24.00    30
22.00    27
18.00    26
28.00    25
30.00    25
         ..
24.50     1
0.67      1
0.42      1
34.50     1
74.00     1
Name: count, Length: 88, dtype: int64

# 데이터를 정렬하는 함수 sort_values(by='컬럼명')

In [56]:
data.sort_values(by="Name")

,PassengerId,Survived,Name,Age,Pclass,Sex,SibSp,Parch,Ticket,Fare,Cabin,Embarked
845,846,0,"Abbing, Mr. Anthony",42.0,3,male,0,0,C.A. 5547,7.5500,NaN,S
746,747,0,"Abbott, Mr. Rossmore Edward",16.0,3,male,1,1,C.A. 2673,20.2500,NaN,S
279,280,1,"Abbott, Mrs. Stanton (Rosa Hunt)",35.0,3,female,1,1,C.A. 2673,20.2500,NaN,S
308,309,0,"Abelson, Mr. Samuel",30.0,2,male,1,0,P/PP 3381,24.0000,NaN,C
874,875,1,"Abelson, Mrs. Samuel (Hannah Wizosky)",28.0,2,female,1,0,P/PP 3381,24.0000,NaN,C
...,...,...,...,...,...,...,...,...,...,...,...,...
286,287,1,"de Mulder, Mr. Theodore",30.0,3,male,0,0,345774,9.5000,NaN,S
282,283,0,"de Pelsmaeker, Mr. Alfons",16.0,3,male,0,0,345778,9.5000,NaN,S
361,362,0,"del Carlo, Mr. Sebastiano",29.0,2,male,1,0,SC/PARIS 2167,27.7208,NaN,C
153,154,0,"van Billiard, Mr. Austin Blyler",40.5,3,male,0,2,A/5. 851,14.5000,NaN,S
868,869,0,"van Melkebeke, Mr. Philemon",NaN,3,male,0,0,345777,9.5000,NaN,S

In [14]:
data.sort_values(by=['Age','Name'],ascending=[False,True])

,PassengerId,Pclass,Ticket,Name,Sex,Age,SibSp,Parch,Fare,Cabin,Embarked,Survived
630,631,1,27042,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,30.0000,A23,S,1
851,852,3,347060,"Svensson, Mr. Johan",male,74.0,0,0,7.7750,NaN,S,0
493,494,1,PC 17609,"Artagaveytia, Mr. Ramon",male,71.0,0,0,49.5042,NaN,C,0
96,97,1,PC 17754,"Goldschmidt, Mr. George B",male,71.0,0,0,34.6542,A5,C,0
116,117,3,370369,"Connors, Mr. Patrick",male,70.5,0,0,7.7500,NaN,Q,0
...,...,...,...,...,...,...,...,...,...,...,...,...
55,56,1,19947,"Woolner, Mr. Hugh",male,NaN,0,0,35.5000,C52,S,1
354,355,3,2647,"Yousif, Mr. Wazli",male,NaN,0,0,7.2250,NaN,C,0
495,496,3,2627,"Yousseff, Mr. Gerious",male,NaN,0,0,14.4583,NaN,C,0
240,241,3,2665,"Zabour, Miss. Thamine",female,NaN,1,0,14.4542,NaN,C,0
868,869,3,345777,"van Melkebeke, Mr. Philemon",male,NaN,0,0,9.5000,NaN,S,0

# 컬럼을 인덱스로 지정하기 set_index("컬럼명")

In [63]:
data=data.set_index(["PassengerId","Name"])

KeyError: "None of ['PassengerId', 'Name'] are in the columns"

In [64]:
data

,,Survived,Age,Pclass,Sex,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,Name,,,,,,,,,,
1,"Braund, Mr. Owen Harris",0,22.0,3,male,1,0,A/5 21171,7.2500,NaN,S
2,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",1,38.0,1,female,1,0,PC 17599,71.2833,C85,C
3,"Heikkinen, Miss. Laina",1,26.0,3,female,0,0,STON/O2. 3101282,7.9250,NaN,S
4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,35.0,1,female,1,0,113803,53.1000,C123,S
5,"Allen, Mr. William Henry",0,35.0,3,male,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
887,"Montvila, Rev. Juozas",0,27.0,2,male,0,0,211536,13.0000,NaN,S
888,"Graham, Miss. Margaret Edith",1,19.0,1,female,0,0,112053,30.0000,B42,S
889,"Johnston, Miss. Catherine Helen ""Carrie""",0,NaN,3,female,1,2,W./C. 6607,23.4500,NaN,S
890,"Behr, Mr. Karl Howell",1,26.0,1,male,0,0,111369,30.0000,C148,C
891,"Dooley, Mr. Patrick",0,32.0,3,male,0,0,370376,7.7500,NaN,Q

# 인덱스를 숫자로 초기화

In [66]:
data=data.reset_index()
data

,PassengerId,Name,Survived,Age,Pclass,Sex,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,"Braund, Mr. Owen Harris",0,22.0,3,male,1,0,A/5 21171,7.2500,NaN,S
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,38.0,1,female,1,0,PC 17599,71.2833,C85,C
2,3,"Heikkinen, Miss. Laina",1,26.0,3,female,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,35.0,1,female,1,0,113803,53.1000,C123,S
4,5,"Allen, Mr. William Henry",0,35.0,3,male,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,"Montvila, Rev. Juozas",0,27.0,2,male,0,0,211536,13.0000,NaN,S
887,888,"Graham, Miss. Margaret Edith",1,19.0,1,female,0,0,112053,30.0000,B42,S
888,889,"Johnston, Miss. Catherine Helen ""Carrie""",0,NaN,3,female,1,2,W./C. 6607,23.4500,NaN,S
889,890,"Behr, Mr. Karl Howell",1,26.0,1,male,0,0,111369,30.0000,C148,C
890,891,"Dooley, Mr. Patrick",0,32.0,3,male,0,0,370376,7.7500,NaN,Q

# 컬럼 이름 출력 .columns

In [68]:
data.columns[0:]

Index(['PassengerId', 'Name', 'Survived', 'Age', 'Pclass', 'Sex', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

# 컬럼 이름 변경하기
* rename({이름1 : 변경할 이름1})
* columns=[컬럼이름]

In [15]:
data = data.rename(columns={"PassengerId" : "승객번호"})
data

,승객번호,Pclass,Ticket,Name,Sex,Age,SibSp,Parch,Fare,Cabin,Embarked,Survived
0,1,3,A/5 21171,"Braund, Mr. Owen Harris",male,22.0,1,0,7.2500,NaN,S,0
1,2,1,PC 17599,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,71.2833,C85,C,1
2,3,3,STON/O2. 3101282,"Heikkinen, Miss. Laina",female,26.0,0,0,7.9250,NaN,S,1
3,4,1,113803,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,53.1000,C123,S,1
4,5,3,373450,"Allen, Mr. William Henry",male,35.0,0,0,8.0500,NaN,S,0
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,2,211536,"Montvila, Rev. Juozas",male,27.0,0,0,13.0000,NaN,S,0
887,888,1,112053,"Graham, Miss. Margaret Edith",female,19.0,0,0,30.0000,B42,S,1
888,889,3,W./C. 6607,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,23.4500,NaN,S,0
889,890,1,111369,"Behr, Mr. Karl Howell",male,26.0,0,0,30.0000,C148,C,1
890,891,3,370376,"Dooley, Mr. Patrick",male,32.0,0,0,7.7500,NaN,Q,0

In [71]:
data.columns

Index(['PassengerId', 'Name', 'Survived', 'Age', 'Pclass', 'Sex', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [18]:
data.columns = ['승객번호', '선실등급', '승차권번호', '승객이름', '성별', '나이', '형제자매수',
       '부모자식수', '승차권금액', '좌석번호', '정박지', '생존여부']

In [19]:
data

,승객번호,선실등급,승차권번호,승객이름,성별,나이,형제자매수,부모자식수,승차권금액,좌석번호,정박지,생존여부
0,1,3,A/5 21171,"Braund, Mr. Owen Harris",male,22.0,1,0,7.2500,NaN,S,0
1,2,1,PC 17599,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,71.2833,C85,C,1
2,3,3,STON/O2. 3101282,"Heikkinen, Miss. Laina",female,26.0,0,0,7.9250,NaN,S,1
3,4,1,113803,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,53.1000,C123,S,1
4,5,3,373450,"Allen, Mr. William Henry",male,35.0,0,0,8.0500,NaN,S,0
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,2,211536,"Montvila, Rev. Juozas",male,27.0,0,0,13.0000,NaN,S,0
887,888,1,112053,"Graham, Miss. Margaret Edith",female,19.0,0,0,30.0000,B42,S,1
888,889,3,W./C. 6607,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,23.4500,NaN,S,0
889,890,1,111369,"Behr, Mr. Karl Howell",male,26.0,0,0,30.0000,C148,C,1
890,891,3,370376,"Dooley, Mr. Patrick",male,32.0,0,0,7.7500,NaN,Q,0

In [20]:
data['가족수'] = data['형제자매수'] + data['부모자식수']
data.head()

,승객번호,선실등급,승차권번호,승객이름,성별,나이,형제자매수,부모자식수,승차권금액,좌석번호,정박지,생존여부,가족수
0,1,3,A/5 21171,"Braund, Mr. Owen Harris",male,22.0,1,0,7.2500,NaN,S,0,1
1,2,1,PC 17599,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,71.2833,C85,C,1,1
2,3,3,STON/O2. 3101282,"Heikkinen, Miss. Laina",female,26.0,0,0,7.9250,NaN,S,1,0
3,4,1,113803,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,53.1000,C123,S,1,1
4,5,3,373450,"Allen, Mr. William Henry",male,35.0,0,0,8.0500,NaN,S,0,0

# 컬럼 삭제하기
* del 변수명['컬럼명]
* 변수명.drop('컬럼명', axis=1)
* 변수명.drop(['컬럼명1','컬럼명2'] axis=1)

In [75]:
data.drop('형제자매수',axis=1)

,승객번호,승객이름,생존여부,나이,선실등급,성별,부모자식수,승차권금액,요금,좌석번호,정박지
0,1,"Braund, Mr. Owen Harris",0,22.0,3,male,0,A/5 21171,7.2500,NaN,S
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,38.0,1,female,0,PC 17599,71.2833,C85,C
2,3,"Heikkinen, Miss. Laina",1,26.0,3,female,0,STON/O2. 3101282,7.9250,NaN,S
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,35.0,1,female,0,113803,53.1000,C123,S
4,5,"Allen, Mr. William Henry",0,35.0,3,male,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
886,887,"Montvila, Rev. Juozas",0,27.0,2,male,0,211536,13.0000,NaN,S
887,888,"Graham, Miss. Margaret Edith",1,19.0,1,female,0,112053,30.0000,B42,S
888,889,"Johnston, Miss. Catherine Helen ""Carrie""",0,NaN,3,female,2,W./C. 6607,23.4500,NaN,S
889,890,"Behr, Mr. Karl Howell",1,26.0,1,male,0,111369,30.0000,C148,C
890,891,"Dooley, Mr. Patrick",0,32.0,3,male,0,370376,7.7500,NaN,Q

# 데이터프레임의 컬럼과 컬럼을 연산해서 새로운 컬럼만들기

# 데이터 타입 바꾸기 .astype() or .apply()
* data['승객번호'].astype('str')
* data['승객번호'].apply(lambda x: str(x))

In [21]:
data['승객번호']=data['승객번호'].astype('str')

# 판다스 데이터 프레임에서 조건에 맞는 행만 가져오기
* 데이터프레임[데이터프레임['컬럼명']조건식] => 조건식이 참인 것만 가져옴
* 조건식 연산자 >, <, ==, !=, >=, <=, &(and), |(or)

In [23]:
data['나이']>35

0      False
1       True
2      False
3      False
4      False
       ...
886    False
887    False
888    False
889    False
890    False
Name: 나이, Length: 891, dtype: bool

In [24]:
data[data['나이']>35]

,승객번호,선실등급,승차권번호,승객이름,성별,나이,형제자매수,부모자식수,승차권금액,좌석번호,정박지,생존여부,가족수
1,2,1,PC 17599,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,71.2833,C85,C,1,1
6,7,1,17463,"McCarthy, Mr. Timothy J",male,54.0,0,0,51.8625,E46,S,0,0
11,12,1,113783,"Bonnell, Miss. Elizabeth",female,58.0,0,0,26.5500,C103,S,1,0
13,14,3,347082,"Andersson, Mr. Anders Johan",male,39.0,1,5,31.2750,NaN,S,0,6
15,16,2,248706,"Hewlett, Mrs. (Mary D Kingcome)",female,55.0,0,0,16.0000,NaN,S,1,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
865,866,2,236852,"Bystrom, Mrs. (Karolina)",female,42.0,0,0,13.0000,NaN,S,1,0
871,872,1,11751,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,1,1,52.5542,D35,S,1,2
873,874,3,345765,"Vander Cruyssen, Mr. Victor",male,47.0,0,0,9.0000,NaN,S,0,0
879,880,1,11767,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,83.1583,C50,C,1,1
885,886,3,382652,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,29.1250,NaN,Q,0,5

* 성별이 여성이면서 나이가 35세 초과인 행 찾기

In [26]:
data[(data['나이']>35) & (data['성별']=='female')]

,승객번호,선실등급,승차권번호,승객이름,성별,나이,형제자매수,부모자식수,승차권금액,좌석번호,정박지,생존여부,가족수
1,2,1,PC 17599,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,71.2833,C85,C,1,1
11,12,1,113783,"Bonnell, Miss. Elizabeth",female,58.0,0,0,26.5500,C103,S,1,0
15,16,2,248706,"Hewlett, Mrs. (Mary D Kingcome)",female,55.0,0,0,16.0000,NaN,S,1,0
25,26,3,347077,"Asplund, Mrs. Carl Oscar (Selma Augusta Emilia...",female,38.0,1,5,31.3875,NaN,S,1,6
40,41,3,7546,"Ahlin, Mrs. Johan (Johanna Persdotter Larsson)",female,40.0,1,0,9.4750,NaN,S,0,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...
862,863,1,17466,"Swift, Mrs. Frederick Joel (Margaret Welles Ba...",female,48.0,0,0,25.9292,D17,S,1,0
865,866,2,236852,"Bystrom, Mrs. (Karolina)",female,42.0,0,0,13.0000,NaN,S,1,0
871,872,1,11751,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,1,1,52.5542,D35,S,1,2
879,880,1,11767,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,83.1583,C50,C,1,1
885,886,3,382652,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,29.1250,NaN,Q,0,5

* 성별이 남성, 선실등급 1 , 생존여부 1인 사람을 찾으세용

In [28]:
data[(data['성별']=='male')&(data['선실등급']==1)&(data['생존여부']==1)]

,승객번호,선실등급,승차권번호,승객이름,성별,나이,형제자매수,부모자식수,승차권금액,좌석번호,정박지,생존여부,가족수
23,24,1,113788,"Sloper, Mr. William Thompson",male,28.00,0,0,35.5000,A6,S,1,0
55,56,1,19947,"Woolner, Mr. Hugh",male,NaN,0,0,35.5000,C52,S,1,0
97,98,1,PC 17759,"Greenfield, Mr. William Bertram",male,23.00,0,1,63.3583,D10 D12,C,1,1
187,188,1,111428,"Romaine, Mr. Charles Hallace (""Mr C Rolmane"")",male,45.00,0,0,26.5500,NaN,S,1,0
209,210,1,112277,"Blank, Mr. Henry",male,40.00,0,0,31.0000,A31,C,1,0
224,225,1,19943,"Hoyt, Mr. Frederick Maxfield",male,38.00,1,0,90.0000,C93,S,1,1
248,249,1,11751,"Beckwith, Mr. Richard Leonard",male,37.00,1,1,52.5542,D35,S,1,2
298,299,1,19988,"Saalfeld, Mr. Adolphe",male,NaN,0,0,30.5000,C106,S,1,0
305,306,1,113781,"Allison, Master. Hudson Trevor",male,0.92,1,2,151.5500,C22 C26,S,1,3
370,371,1,11765,"Harder, Mr. George Achilles",male,25.00,1,0,55.4417,E50,C,1,1
390,391,1,113760,"Carter, Mr. William Ernest",male,36.00,1,2,120.0000,B96 B98,S,1,3
430,431,1,110564,"Bjornstrom-Steffansson, Mr. Mauritz Hakan",male,28.00,0,0,26.5500,C52,S,1,0
445,446,1,33638,"Dodge, Master. Washington",male,4.00,0,2,81.8583,A34,S,1,2
447,448,1,113794,"Seward, Mr. Frederic Kimber",male,34.00,0,0,26.5500,NaN,S,1,0
449,450,1,113786,"Peuchen, Major. Arthur Godfrey",male,52.00,0,0,30.5000,C104,S,1,0
453,454,1,17453,"Goldenberg, Mr. Samuel L",male,49.00,1,0,89.1042,C92,C,1,1
460,461,1,19952,"Anderson, Mr. Harry",male,48.00,0,0,26.5500,E12,S,1,0
484,485,1,11967,"Bishop, Mr. Dickinson H",male,25.00,1,0,91.0792,B49,C,1,1
507,508,1,111427,"Bradley, Mr. George (""George Arthur Brayton"")",male,NaN,0,0,26.5500,NaN,S,1,0
512,513,1,PC 17473,"McGough, Mr. James Robert",male,36.00,0,0,26.2875,E25,S,1,0
550,551,1,17421,"Thayer, Mr. John Borland Jr",male,17.00,0,2,110.8833,C70,C,1,2
572,573,1,PC 17474,"Flynn, Mr. John Irwin (""Irving"")",male,36.00,0,0,26.3875,E25,S,1,0
587,588,1,13567,"Frolicher-Stehli, Mr. Maxmillian",male,60.00,1,1,79.2000,B41,C,1,2
599,600,1,PC 17485,"Duff Gordon, Sir. Cosmo Edmund (""Mr Morgan"")",male,49.00,1,0,56.9292,A20,C,1,1
604,605,1,111426,"Homer, Mr. Harry (""Mr E Haven"")",male,35.00,0,0,26.5500,NaN,C,1,0
607,608,1,113804,"Daniel, Mr. Robert Williams",male,27.00,0,0,30.5000,NaN,S,1,0
621,622,1,11753,"Kimball, Mr. Edwin Nelson Jr",male,42.00,1,0,52.5542,D19,S,1,1
630,631,1,27042,"Barkworth, Mr. Algernon Henry Wilson",male,80.00,0,0,30.0000,A23,S,1,0
632,633,1,13214,"Stahelin-Maeglin, Dr. Max",male,32.00,0,0,30.5000,B50,C,1,0
645,646,1,PC 17572,"Harper, Mr. Henry Sleeper",male,48.00,1,0,76.7292,D33,C,1,1
647,648,1,13213,"Simonius-Blumer, Col. Oberst Alfons",male,56.00,0,0,35.5000,A26,C,1,0
660,661,1,PC 17611,"Frauenthal, Dr. Henry William",male,50.00,2,0,133.6500,NaN,S,1,2
679,680,1,PC 17755,"Cardeza, Mr. Thomas Drake Martinez",male,36.00,0,1,512.3292,B51 B53 B55,C,1,1
681,682,1,PC 17572,"Hassab, Mr. Hammad",male,27.00,0,0,76.7292,D49,C,1,0
690,691,1,17474,"Dick, Mr. Albert Adrian",male,31.00,1,0,57.0000,B20,S,1,1
701,702,1,PC 17475,"Silverthorne, Mr. Spencer Victor",male,35.00,0,0,26.2875,E24,S,1,0
707,708,1,PC 17476,"Calderhead, Mr. Edward Pennington",male,42.00,0,0,26.2875,E24,S,1,0
712,713,1,19996,"Taylor, Mr. Elmer Zebley",male,48.00,1,0,52.0000,C126,S,1,1
724,725,1,113806,"Chambers, Mr. Norman Campbell",male,27.00,1,0,53.1000,E8,S,1,1
737,738,1,PC 17755,"Lesurer, Mr. Gustave J",male,35.00,0,0,512.3292,B101,C,1,0
740,741,1,16988,"Hawksford, Mr. Walter James",male,NaN,0,0,30.0000,D45,S,1,0
802,803,1,113760,"Carter, Master. William Thornton II",male,11.00,1,2,120.0000,B96 B98,S,1,3
839,840,1,11774,"Marechal, Mr. Pierre",male,NaN,0,0,29.7000,C47,C,1,0
857,858,1,113055,"Daly, Mr. Peter Denis",male,51.00,0,0,26.5500,E17,S,1,0
889,890,1,111369,"Behr, Mr. Karl Howell",male,26.00,0,0,30.0000,C148,C,1,0

* 승차권 금액이 0원인 사람

In [30]:
data[data['승차권금액']==0]

,승객번호,선실등급,승차권번호,승객이름,성별,나이,형제자매수,부모자식수,승차권금액,좌석번호,정박지,생존여부,가족수
179,180,3,LINE,"Leonard, Mr. Lionel",male,36.0,0,0,0.0,NaN,S,0,0
263,264,1,112059,"Harrison, Mr. William",male,40.0,0,0,0.0,B94,S,0,0
271,272,3,LINE,"Tornquist, Mr. William Henry",male,25.0,0,0,0.0,NaN,S,1,0
277,278,2,239853,"Parkes, Mr. Francis ""Frank""",male,NaN,0,0,0.0,NaN,S,0,0
302,303,3,LINE,"Johnson, Mr. William Cahoone Jr",male,19.0,0,0,0.0,NaN,S,0,0
413,414,2,239853,"Cunningham, Mr. Alfred Fleming",male,NaN,0,0,0.0,NaN,S,0,0
466,467,2,239853,"Campbell, Mr. William",male,NaN,0,0,0.0,NaN,S,0,0
481,482,2,239854,"Frost, Mr. Anthony Wood ""Archie""",male,NaN,0,0,0.0,NaN,S,0,0
597,598,3,LINE,"Johnson, Mr. Alfred",male,49.0,0,0,0.0,NaN,S,0,0
633,634,1,112052,"Parr, Mr. William Henry Marsh",male,NaN,0,0,0.0,NaN,S,0,0
674,675,2,239856,"Watson, Mr. Ennis Hastings",male,NaN,0,0,0.0,NaN,S,0,0
732,733,2,239855,"Knight, Mr. Robert J",male,NaN,0,0,0.0,NaN,S,0,0
806,807,1,112050,"Andrews, Mr. Thomas Jr",male,39.0,0,0,0.0,A36,S,0,0
815,816,1,112058,"Fry, Mr. Richard",male,NaN,0,0,0.0,B102,S,0,0
822,823,1,19972,"Reuchlin, Jonkheer. John George",male,38.0,0,0,0.0,NaN,S,0,0

* 남자이면서 생존한 사람

In [31]:
data[(data['성별']=='male')&(data['생존여부']==1)]

,승객번호,선실등급,승차권번호,승객이름,성별,나이,형제자매수,부모자식수,승차권금액,좌석번호,정박지,생존여부,가족수
17,18,2,244373,"Williams, Mr. Charles Eugene",male,NaN,0,0,13.0000,NaN,S,1,0
21,22,2,248698,"Beesley, Mr. Lawrence",male,34.0,0,0,13.0000,D56,S,1,0
23,24,1,113788,"Sloper, Mr. William Thompson",male,28.0,0,0,35.5000,A6,S,1,0
36,37,3,2677,"Mamee, Mr. Hanna",male,NaN,0,0,7.2292,NaN,C,1,0
55,56,1,19947,"Woolner, Mr. Hugh",male,NaN,0,0,35.5000,C52,S,1,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
838,839,3,1601,"Chip, Mr. Chang",male,32.0,0,0,56.4958,NaN,S,1,0
839,840,1,11774,"Marechal, Mr. Pierre",male,NaN,0,0,29.7000,C47,C,1,0
857,858,1,113055,"Daly, Mr. Peter Denis",male,51.0,0,0,26.5500,E17,S,1,0
869,870,3,347742,"Johnson, Master. Harold Theodor",male,4.0,1,1,11.1333,NaN,S,1,2
889,890,1,111369,"Behr, Mr. Karl Howell",male,26.0,0,0,30.0000,C148,C,1,0

* 선실등급이 1이거나 2이면서 생존한 여성

In [33]:
data[((data['선실등급']==1)|(data['선실등급']==2))&(data['생존여부']==1)]

,승객번호,선실등급,승차권번호,승객이름,성별,나이,형제자매수,부모자식수,승차권금액,좌석번호,정박지,생존여부,가족수
1,2,1,PC 17599,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,71.2833,C85,C,1,1
3,4,1,113803,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,53.1000,C123,S,1,1
9,10,2,237736,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,30.0708,NaN,C,1,1
11,12,1,113783,"Bonnell, Miss. Elizabeth",female,58.0,0,0,26.5500,C103,S,1,0
15,16,2,248706,"Hewlett, Mrs. (Mary D Kingcome)",female,55.0,0,0,16.0000,NaN,S,1,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
874,875,2,P/PP 3381,"Abelson, Mrs. Samuel (Hannah Wizosky)",female,28.0,1,0,24.0000,NaN,C,1,1
879,880,1,11767,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,83.1583,C50,C,1,1
880,881,2,230433,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,0,1,26.0000,NaN,S,1,1
887,888,1,112053,"Graham, Miss. Margaret Edith",female,19.0,0,0,30.0000,B42,S,1,0
889,890,1,111369,"Behr, Mr. Karl Howell",male,26.0,0,0,30.0000,C148,C,1,0

* 선실등급이 1이거나 2이면서 생존한 여성 중에서 이름 컬럼만 보고 싶을 때
* 데이터프레임.loc[데이터프레임['컬럼명'] 조건, '원하는 컬럼명']
* 데이터프레임.[데이터프레임['컬럼명']조건]['원하는컬럼명']

In [38]:
data.loc[((data['선실등급']==1)|(data['선실등급']==2))&(data['생존여부']==1)&(data['성별']=='female'),'승객이름']

1      Cumings, Mrs. John Bradley (Florence Briggs Th...
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
9                    Nasser, Mrs. Nicholas (Adele Achem)
11                              Bonnell, Miss. Elizabeth
15                      Hewlett, Mrs. (Mary D Kingcome)
                             ...
871     Beckwith, Mrs. Richard Leonard (Sallie Monypeny)
874                Abelson, Mrs. Samuel (Hannah Wizosky)
879        Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)
880         Shelley, Mrs. William (Imanita Parrish Hall)
887                         Graham, Miss. Margaret Edith
Name: 승객이름, Length: 161, dtype: object

In [42]:
data.loc[data['선실등급']==1,['승객이름','선실등급']]

                                                  승객이름  선실등급
1    Cumings, Mrs. John Bradley (Florence Briggs Th...     1
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)     1
6                              McCarthy, Mr. Timothy J     1
11                            Bonnell, Miss. Elizabeth     1
23                        Sloper, Mr. William Thompson     1
..                                                 ...   ...
871   Beckwith, Mrs. Richard Leonard (Sallie Monypeny)     1
872                           Carlsson, Mr. Frans Olof     1
879      Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)     1
887                       Graham, Miss. Margaret Edith     1
889                              Behr, Mr. Karl Howell     1

[216 rows x 2 columns]

* ((data['선실등급']==1) | (data['선실등급']==2))

* isin을 쓰면 위의 긴 코드를 아래처럼 줄일 수 있다.

In [43]:
data[data['선실등급'].isin([1,2])]

,승객번호,선실등급,승차권번호,승객이름,성별,나이,형제자매수,부모자식수,승차권금액,좌석번호,정박지,생존여부,가족수
1,2,1,PC 17599,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,71.2833,C85,C,1,1
3,4,1,113803,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,53.1000,C123,S,1,1
6,7,1,17463,"McCarthy, Mr. Timothy J",male,54.0,0,0,51.8625,E46,S,0,0
9,10,2,237736,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,30.0708,NaN,C,1,1
11,12,1,113783,"Bonnell, Miss. Elizabeth",female,58.0,0,0,26.5500,C103,S,1,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
880,881,2,230433,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,0,1,26.0000,NaN,S,1,1
883,884,2,C.A./SOTON 34068,"Banfield, Mr. Frederick James",male,28.0,0,0,10.5000,NaN,S,0,0
886,887,2,211536,"Montvila, Rev. Juozas",male,27.0,0,0,13.0000,NaN,S,0,0
887,888,1,112053,"Graham, Miss. Margaret Edith",female,19.0,0,0,30.0000,B42,S,1,0
889,890,1,111369,"Behr, Mr. Karl Howell",male,26.0,0,0,30.0000,C148,C,1,0

## 특정 단어를 포함한 행을 찾기 
* ex) 이름에 joseph이 들어간 사람

* like %단어% -sql
* .str.contains("찾을단어")

In [49]:
data[data['승객이름'].str.contains("Joseph")]

,승객번호,선실등급,승차권번호,승객이름,성별,나이,형제자매수,부모자식수,승차권금액,좌석번호,정박지,생존여부,가족수
20,21,2,239865,"Fynney, Mr. Joseph J",male,35.0,0,0,26.0000,NaN,S,0,0
34,35,1,PC 17604,"Meyer, Mr. Edgar Joseph",male,28.0,1,0,82.1708,NaN,C,0,1
95,96,3,374910,"Shorney, Mr. Charles Joseph",male,NaN,0,0,8.0500,NaN,S,0,0
140,141,3,2678,"Boulos, Mrs. Joseph (Sultana)",female,NaN,0,2,15.2458,NaN,C,0,2
145,146,2,C.A. 33112,"Nicholls, Mr. Joseph Charles",male,19.0,1,1,36.7500,NaN,S,0,2
194,195,1,PC 17610,"Brown, Mrs. James Joseph (Margaret Tobin)",female,44.0,0,0,27.7208,B4,C,1,0
375,376,1,PC 17604,"Meyer, Mrs. Edgar Joseph (Leila Saks)",female,NaN,1,0,82.1708,NaN,C,1,1
454,455,3,A/5 2817,"Peduzzi, Mr. Joseph",male,NaN,0,0,8.0500,NaN,S,0,0
532,533,3,2690,"Elias, Mr. Joseph Jr",male,17.0,1,1,7.2292,NaN,C,0,2
559,560,3,345572,"de Messemaeker, Mrs. Guillaume Joseph (Emma)",female,36.0,1,0,17.4000,NaN,S,1,1
578,579,3,2689,"Caram, Mrs. Joseph (Maria Elias)",female,NaN,1,0,14.4583,NaN,C,0,1
589,590,3,A./5. 3235,"Murdlin, Mr. Joseph",male,NaN,0,0,8.0500,NaN,S,0,0
608,609,2,SC/Paris 2123,"Laroche, Mrs. Joseph (Juliette Marie Louise La...",female,22.0,1,2,41.5792,NaN,C,1,3
685,686,2,SC/Paris 2123,"Laroche, Mr. Joseph Philippe Lemercier",male,25.0,1,2,41.5792,NaN,C,0,3
752,753,3,345780,"Vande Velde, Mr. Johannes Joseph",male,33.0,0,0,9.5000,NaN,S,0,0
828,829,3,367228,"McCormack, Mr. Thomas Joseph",male,NaN,0,0,7.7500,NaN,Q,1,0

* 승차권에 PC가 포함된 승차권 찾기

In [52]:
data[data['승차권번호'].str.contains("PC")]

,승객번호,선실등급,승차권번호,승객이름,성별,나이,형제자매수,부모자식수,승차권금액,좌석번호,정박지,생존여부,가족수
1,2,1,PC 17599,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,71.2833,C85,C,1,1
30,31,1,PC 17601,"Uruchurtu, Don. Manuel E",male,40.0,0,0,27.7208,NaN,C,0,0
31,32,1,PC 17569,"Spencer, Mrs. William Augustus (Marie Eugenie)",female,NaN,1,0,146.5208,B78,C,1,1
34,35,1,PC 17604,"Meyer, Mr. Edgar Joseph",male,28.0,1,0,82.1708,NaN,C,0,1
52,53,1,PC 17572,"Harper, Mrs. Henry Sleeper (Myna Haxtun)",female,49.0,1,0,76.7292,D33,C,1,1
64,65,1,PC 17605,"Stewart, Mr. Albert A",male,NaN,0,0,27.7208,NaN,C,0,0
96,97,1,PC 17754,"Goldschmidt, Mr. George B",male,71.0,0,0,34.6542,A5,C,0,0
97,98,1,PC 17759,"Greenfield, Mr. William Bertram",male,23.0,0,1,63.3583,D10 D12,C,1,1
118,119,1,PC 17558,"Baxter, Mr. Quigg Edmond",male,24.0,0,1,247.5208,B58 B60,C,0,1
139,140,1,PC 17593,"Giglio, Mr. Victor",male,24.0,0,0,79.2000,B86,C,0,0
155,156,1,PC 17597,"Williams, Mr. Charles Duane",male,51.0,0,1,61.3792,NaN,C,0,1
168,169,1,PC 17318,"Baumann, Mr. John D",male,NaN,0,0,25.9250,NaN,S,0,0
177,178,1,PC 17595,"Isham, Miss. Ann Elizabeth",female,50.0,0,0,28.7125,C49,C,0,0
194,195,1,PC 17610,"Brown, Mrs. James Joseph (Margaret Tobin)",female,44.0,0,0,27.7208,B4,C,1,0
195,196,1,PC 17569,"Lurette, Miss. Elise",female,58.0,0,0,146.5208,B80,C,1,0
256,257,1,PC 17585,"Thorne, Mrs. Gertrude Maybelle",female,NaN,0,0,79.2000,NaN,C,1,0
258,259,1,PC 17755,"Ward, Miss. Anna",female,35.0,0,0,512.3292,NaN,C,1,0
268,269,1,PC 17582,"Graham, Mrs. William Thompson (Edith Junkins)",female,58.0,0,1,153.4625,C125,S,1,1
269,270,1,PC 17760,"Bissette, Miss. Amelia",female,35.0,0,0,135.6333,C99,S,1,0
273,274,1,PC 17596,"Natsch, Mr. Charles H",male,37.0,0,1,29.7000,C118,C,0,1
295,296,1,PC 17612,"Lewy, Mr. Ervin G",male,NaN,0,0,27.7208,NaN,C,0,0
299,300,1,PC 17558,"Baxter, Mrs. James (Helene DeLaudeniere Chaput)",female,50.0,0,1,247.5208,B58 B60,C,1,1
307,308,1,PC 17758,"Penasco y Castellana, Mrs. Victor de Satode (M...",female,17.0,1,0,108.9000,C65,C,1,1
309,310,1,PC 17485,"Francatelli, Miss. Laura Mabel",female,30.0,0,0,56.9292,E36,C,1,0
311,312,1,PC 17608,"Ryerson, Miss. Emily Borie",female,18.0,2,2,262.3750,B57 B59 B63 B66,C,1,4
325,326,1,PC 17760,"Young, Miss. Marie Grice",female,36.0,0,0,135.6333,C32,C,1,0
332,333,1,PC 17582,"Graham, Mr. George Edward",male,38.0,0,1,153.4625,C91,S,0,1
334,335,1,PC 17611,"Frauenthal, Mrs. Henry William (Clara Heinshei...",female,NaN,1,0,133.6500,NaN,S,1,1
369,370,1,PC 17477,"Aubart, Mme. Leontine Pauline",female,24.0,0,0,69.3000,B35,C,1,0
373,374,1,PC 17760,"Ringhini, Mr. Sante",male,22.0,0,0,135.6333,NaN,C,0,0
375,376,1,PC 17604,"Meyer, Mrs. Edgar Joseph (Leila Saks)",female,NaN,1,0,82.1708,NaN,C,1,1
380,381,1,PC 17757,"Bidois, Miss. Rosalie",female,42.0,0,0,227.5250,NaN,C,1,0
493,494,1,PC 17609,"Artagaveytia, Mr. Ramon",male,71.0,0,0,49.5042,NaN,C,0,0
505,506,1,PC 17758,"Penasco y Castellana, Mr. Victor de Satode",male,18.0,1,0,108.9000,C65,C,0,1
512,513,1,PC 17473,"McGough, Mr. James Robert",male,36.0,0,0,26.2875,E25,S,1,0
513,514,1,PC 17603,"Rothschild, Mrs. Martin (Elizabeth L. Barrett)",female,54.0,1,0,59.4000,NaN,C,1,1
527,528,1,PC 17483,"Farthing, Mr. John",male,NaN,0,0,221.7792,C95,S,0,0
537,538,1,PC 17761,"LeRoy, Miss. Bertha",female,30.0,0,0,106.4250,NaN,C,1,0
544,545,1,PC 17761,"Douglas, Mr. Walter Donald",male,50.0,1,0,106.4250,C86,C,0,1
557,558,1,PC 17757,"Robbins, Mr. Victor",male,NaN,0,0,227.5250,NaN,C,0,0
572,573,1,PC 17474,"Flynn, Mr. John Irwin (""Irving"")",male,36.0,0,0,26.3875,E25,S,1,0
599,600,1,PC 17485,"Duff Gordon, Sir. Cosmo Edmund (""Mr Morgan"")",male,49.0,1,0,56.9292,A20,C,1,1
609,610,1,PC 17582,"Shutes, Miss. Elizabeth W",female,40.0,0,0,153.4625,C125,S,1,0
641,642,1,PC 17477,"Sagesser, Mlle. Emma",female,24.0,0,0,69.3000,B35,C,1,0
645,646,1,PC 17572,"Harper, Mr. Henry Sleeper",male,48.0,1,0,76.7292,D33,C,1,1
660,661,1,PC 17611,"Frauenthal, Dr. Henry William",male,50.0,2,0,133.6500,NaN,S,1,2
679,680,1,PC 17755,"Cardeza, Mr. Thomas Drake Martinez",male,36.0,0,1,512.3292,B51 B53 B55,C,1,1
681,682,1,PC 17572,"Hassab, Mr. Hammad",male,27.0,0,0,76.7292,D49,C,1,0
700,701,1,PC 17757,"Astor, Mrs. John Jacob (Madeleine Talmadge Force)",female,18.0,1,0,227.5250,C62 C64,C,1,1
701,702,1,PC 17475,"Silverthorne, Mr. Spencer Victor",male,35.0,0,0,26.2875,E24,S,1,0
707,708,1,PC 17476,"Calderhead, Mr. Edward Pennington",male,42.0,0,0,26.2875,E24,S,1,0
710,711,1,PC 17482,"Mayne, Mlle. Berthe Antonine (""Mrs de Villiers"")",female,24.0,0,0,49.5042,C90,C,1,0
716,717,1,PC 17757,"Endres, Miss. Caroline Louise",female,38.0,0,0,227.5250,C45,C,1,0
737,738,1,PC 17755,"Lesurer, Mr. Gustave J",male,35.0,0,0,512.3292,B101,C,1,0
742,743,1,PC 17608,"Ryerson, Miss. Susan Parker ""Suzette""",female,21.0,2,2,262.3750,B57 B59 B63 B66,C,1,4
789,790,1,PC 17593,"Guggenheim, Mr. Benjamin",male,46.0,0,0,79.2000,B82 B84,C,0,0
793,794,1,PC 17600,"Hoyt, Mr. William Fisher",male,NaN,0,0,30.6958,NaN,C,0,0
835,836,1,PC 17756,"Compton, Miss. Sara Rebecca",female,39.0,1,1,83.1583,E49,C,1,2
853,854,1,PC 17592,"Lines, Miss. Mary Conover",female,16.0,0,1,39.4000,D28,S,1,1
867,868,1,PC 17590,"Roebling, Mr. Washington Augustus II",male,31.0,0,0,50.4958,A24,S,0,0

승객이름에서 () 없애기
* 1. 반복문 써서 제거
* 2. .apply(lambda x: x.replace('(','').replace(')',''))
* 3. .str.replace('(','').str.replace(')','')

In [61]:
result=[]
for name in data['승객이름']:
    result.append(name.replace('(','').replace(')',''))
result

['Braund, Mr. Owen Harris',
 'Cumings, Mrs. John Bradley Florence Briggs Thayer',
 'Heikkinen, Miss. Laina',
 'Futrelle, Mrs. Jacques Heath Lily May Peel',
 'Allen, Mr. William Henry',
 'Moran, Mr. James',
 'McCarthy, Mr. Timothy J',
 'Palsson, Master. Gosta Leonard',
 'Johnson, Mrs. Oscar W Elisabeth Vilhelmina Berg',
 'Nasser, Mrs. Nicholas Adele Achem',
 'Sandstrom, Miss. Marguerite Rut',
 'Bonnell, Miss. Elizabeth',
 'Saundercock, Mr. William Henry',
 'Andersson, Mr. Anders Johan',
 'Vestrom, Miss. Hulda Amanda Adolfina',
 'Hewlett, Mrs. Mary D Kingcome ',
 'Rice, Master. Eugene',
 'Williams, Mr. Charles Eugene',
 'Vander Planke, Mrs. Julius Emelia Maria Vandemoortele',
 'Masselmani, Mrs. Fatima',
 'Fynney, Mr. Joseph J',
 'Beesley, Mr. Lawrence',
 'McGowan, Miss. Anna "Annie"',
 'Sloper, Mr. William Thompson',
 'Palsson, Miss. Torborg Danira',
 'Asplund, Mrs. Carl Oscar Selma Augusta Emilia Johansson',
 'Emir, Mr. Farred Chehab',
 'Fortune, Mr. Charles Alexander',
 'O\'Dwyer, Miss. Ellen "Nellie"',
 'Todoroff, Mr. Lalio',
 'Uruchurtu, Don. Manuel E',
 'Spencer, Mrs. William Augustus Marie Eugenie',
 'Glynn, Miss. Mary Agatha',
 'Wheadon, Mr. Edward H',
 'Meyer, Mr. Edgar Joseph',
 'Holverson, Mr. Alexander Oskar',
 'Mamee, Mr. Hanna',
 'Cann, Mr. Ernest Charles',
 'Vander Planke, Miss. Augusta Maria',
 'Nicola-Yarred, Miss. Jamila',
 'Ahlin, Mrs. Johan Johanna Persdotter Larsson',
 'Turpin, Mrs. William John Robert Dorothy Ann Wonnacott',
 'Kraeff, Mr. Theodor',
 'Laroche, Miss. Simonne Marie Anne Andree',
 'Devaney, Miss. Margaret Delia',
 'Rogers, Mr. William John',
 'Lennon, Mr. Denis',
 "O'Driscoll, Miss. Bridget",
 'Samaan, Mr. Youssef',
 'Arnold-Franchi, Mrs. Josef Josefine Franchi',
 'Panula, Master. Juha Niilo',
 'Nosworthy, Mr. Richard Cater',
 'Harper, Mrs. Henry Sleeper Myna Haxtun',
 'Faunthorpe, Mrs. Lizzie Elizabeth Anne Wilkinson',
 'Ostby, Mr. Engelhart Cornelius',
 'Woolner, Mr. Hugh',
 'Rugg, Miss. Emily',
 'Novel, Mr. Mansouer',
 'West, Miss. Constance Mirium',
 'Goodwin, Master. William Frederick',
 'Sirayanian, Mr. Orsen',
 'Icard, Miss. Amelie',
 'Harris, Mr. Henry Birkhardt',
 'Skoog, Master. Harald',
 'Stewart, Mr. Albert A',
 'Moubarek, Master. Gerios',
 'Nye, Mrs. Elizabeth Ramell',
 'Crease, Mr. Ernest James',
 'Andersson, Miss. Erna Alexandra',
 'Kink, Mr. Vincenz',
 'Jenkin, Mr. Stephen Curnow',
 'Goodwin, Miss. Lillian Amy',
 'Hood, Mr. Ambrose Jr',
 'Chronopoulos, Mr. Apostolos',
 'Bing, Mr. Lee',
 'Moen, Mr. Sigurd Hansen',
 'Staneff, Mr. Ivan',
 'Moutal, Mr. Rahamin Haim',
 'Caldwell, Master. Alden Gates',
 'Dowdell, Miss. Elizabeth',
 'Waelens, Mr. Achille',
 'Sheerlinck, Mr. Jan Baptist',
 'McDermott, Miss. Brigdet Delia',
 'Carrau, Mr. Francisco M',
 'Ilett, Miss. Bertha',
 'Backstrom, Mrs. Karl Alfred Maria Mathilda Gustafsson',
 'Ford, Mr. William Neal',
 'Slocovski, Mr. Selman Francis',
 'Fortune, Miss. Mabel Helen',
 'Celotti, Mr. Francesco',
 'Christmann, Mr. Emil',
 'Andreasson, Mr. Paul Edvin',
 'Chaffee, Mr. Herbert Fuller',
 'Dean, Mr. Bertram Frank',
 'Coxon, Mr. Daniel',
 'Shorney, Mr. Charles Joseph',
 'Goldschmidt, Mr. George B',
 'Greenfield, Mr. William Bertram',
 'Doling, Mrs. John T Ada Julia Bone',
 'Kantor, Mr. Sinai',
 'Petranec, Miss. Matilda',
 'Petroff, Mr. Pastcho "Pentcho"',
 'White, Mr. Richard Frasar',
 'Johansson, Mr. Gustaf Joel',
 'Gustafsson, Mr. Anders Vilhelm',
 'Mionoff, Mr. Stoytcho',
 'Salkjelsvik, Miss. Anna Kristine',
 'Moss, Mr. Albert Johan',
 'Rekic, Mr. Tido',
 'Moran, Miss. Bertha',
 'Porter, Mr. Walter Chamberlain',
 'Zabour, Miss. Hileni',
 'Barton, Mr. David John',
 'Jussila, Miss. Katriina',
 'Attalah, Miss. Malake',
 'Pekoniemi, Mr. Edvard',
 'Connors, Mr. Patrick',
 'Turpin, Mr. William John Robert',
 'Baxter, Mr. Quigg Edmond',
 'Andersson, Miss. Ellis Anna Maria',
 'Hickman, Mr. Stanley George',
 'Moore, Mr. Leonard Charles',
 'Nasser, Mr. Nicholas',
 'Webber, Miss. Susan',
 'White, Mr. Percival Wayland',
 'Nicola-Yarred, Master. Elias',
 'McMahon, Mr. Martin',
 'Madsen, Mr. Fridtjof Arne',
 'Peter, Miss. Anna',
 'Ekstrom, Mr. Johan',
 'Drazenoic, Mr. Jozef',
 'Coelho, Mr. Domingos Fernandeo',
 'Robins, Mrs. Alexander A Grace Charity Laury',
 'Weisz, Mrs. Leopold Mathilde Francoise Pede',
 'Sobey, Mr. Samuel James Hayden',
 'Richard, Mr. Emile',
 'Newsom, Miss. Helen Monypeny',
 'Futrelle, Mr. Jacques Heath',
 'Osen, Mr. Olaf Elon',
 'Giglio, Mr. Victor',
 'Boulos, Mrs. Joseph Sultana',
 'Nysten, Miss. Anna Sofia',
 'Hakkarainen, Mrs. Pekka Pietari Elin Matilda Dolck',
 'Burke, Mr. Jeremiah',
 'Andrew, Mr. Edgardo Samuel',
 'Nicholls, Mr. Joseph Charles',
 'Andersson, Mr. August Edvard "Wennerstrom"',
 'Ford, Miss. Robina Maggie "Ruby"',
 'Navratil, Mr. Michel "Louis M Hoffman"',
 'Byles, Rev. Thomas Roussel Davids',
 'Bateman, Rev. Robert James',
 'Pears, Mrs. Thomas Edith Wearne',
 'Meo, Mr. Alfonzo',
 'van Billiard, Mr. Austin Blyler',
 'Olsen, Mr. Ole Martin',
 'Williams, Mr. Charles Duane',
 'Gilnagh, Miss. Katherine "Katie"',
 'Corn, Mr. Harry',
 'Smiljanic, Mr. Mile',
 'Sage, Master. Thomas Henry',
 'Cribb, Mr. John Hatfield',
 'Watt, Mrs. James Elizabeth "Bessie" Inglis Milne',
 'Bengtsson, Mr. John Viktor',
 'Calic, Mr. Jovo',
 'Panula, Master. Eino Viljami',
 'Goldsmith, Master. Frank John William "Frankie"',
 'Chibnall, Mrs. Edith Martha Bowerman',
 'Skoog, Mrs. William Anna Bernhardina Karlsson',
 'Baumann, Mr. John D',
 'Ling, Mr. Lee',
 'Van der hoef, Mr. Wyckoff',
 'Rice, Master. Arthur',
 'Johnson, Miss. Eleanor Ileen',
 'Sivola, Mr. Antti Wilhelm',
 'Smith, Mr. James Clinch',
 'Klasen, Mr. Klas Albin',
 'Lefebre, Master. Henry Forbes',
 'Isham, Miss. Ann Elizabeth',
 'Hale, Mr. Reginald',
 'Leonard, Mr. Lionel',
 'Sage, Miss. Constance Gladys',
 'Pernot, Mr. Rene',
 'Asplund, Master. Clarence Gustaf Hugo',
 'Becker, Master. Richard F',
 'Kink-Heilmann, Miss. Luise Gretchen',
 'Rood, Mr. Hugh Roscoe',
 'O\'Brien, Mrs. Thomas Johanna "Hannah" Godfrey',
 'Romaine, Mr. Charles Hallace "Mr C Rolmane"',
 'Bourke, Mr. John',
 'Turcin, Mr. Stjepan',
 'Pinsky, Mrs. Rosa',
 'Carbines, Mr. William',
 'Andersen-Jensen, Miss. Carla Christine Nielsine',
 'Navratil, Master. Michel M',
 'Brown, Mrs. James Joseph Margaret Tobin',
 'Lurette, Miss. Elise',
 'Mernagh, Mr. Robert',
 'Olsen, Mr. Karl Siegwart Andreas',
 'Madigan, Miss. Margaret "Maggie"',
 'Yrois, Miss. Henriette "Mrs Harbeck"',
 'Vande Walle, Mr. Nestor Cyriel',
 'Sage, Mr. Frederick',
 'Johanson, Mr. Jakob Alfred',
 'Youseff, Mr. Gerious',
 'Cohen, Mr. Gurshon "Gus"',
 'Strom, Miss. Telma Matilda',
 'Backstrom, Mr. Karl Alfred',
 'Albimona, Mr. Nassef Cassem',
 'Carr, Miss. Helen "Ellen"',
 'Blank, Mr. Henry',
 'Ali, Mr. Ahmed',
 'Cameron, Miss. Clear Annie',
 'Perkin, Mr. John Henry',
 'Givard, Mr. Hans Kristensen',
 'Kiernan, Mr. Philip',
 'Newell, Miss. Madeleine',
 'Honkanen, Miss. Eliina',
 'Jacobsohn, Mr. Sidney Samuel',
 'Bazzani, Miss. Albina',
 'Harris, Mr. Walter',
 'Sunderland, Mr. Victor Francis',
 'Bracken, Mr. James H',
 'Green, Mr. George Henry',
 'Nenkoff, Mr. Christo',
 'Hoyt, Mr. Frederick Maxfield',
 'Berglund, Mr. Karl Ivar Sven',
 'Mellors, Mr. William John',
 'Lovell, Mr. John Hall "Henry"',
 'Fahlstrom, Mr. Arne Jonas',
 'Lefebre, Miss. Mathilde',
 'Harris, Mrs. Henry Birkhardt Irene Wallach',
 'Larsson, Mr. Bengt Edvin',
 'Sjostedt, Mr. Ernst Adolf',
 'Asplund, Miss. Lillian Gertrud',
 'Leyson, Mr. Robert William Norman',
 'Harknett, Miss. Alice Phoebe',
 'Hold, Mr. Stephen',
 'Collyer, Miss. Marjorie "Lottie"',
 'Pengelly, Mr. Frederick William',
 'Hunt, Mr. George Henry',
 'Zabour, Miss. Thamine',
 'Murphy, Miss. Katherine "Kate"',
 'Coleridge, Mr. Reginald Charles',
 'Maenpaa, Mr. Matti Alexanteri',
 'Attalah, Mr. Sleiman',
 'Minahan, Dr. William Edward',
 'Lindahl, Miss. Agda Thorilda Viktoria',
 'Hamalainen, Mrs. William Anna',
 'Beckwith, Mr. Richard Leonard',
 'Carter, Rev. Ernest Courtenay',
 'Reed, Mr. James George',
 'Strom, Mrs. Wilhelm Elna Matilda Persson',
 'Stead, Mr. William Thomas',
 'Lobb, Mr. William Arthur',
 'Rosblom, Mrs. Viktor Helena Wilhelmina',
 'Touma, Mrs. Darwis Hanne Youssef Razi',
 'Thorne, Mrs. Gertrude Maybelle',
 'Cherry, Miss. Gladys',
 'Ward, Miss. Anna',
 'Parrish, Mrs. Lutie Davis',
 'Smith, Mr. Thomas',
 'Asplund, Master. Edvin Rojj Felix',
 'Taussig, Mr. Emil',
 'Harrison, Mr. William',
 'Henry, Miss. Delia',
 'Reeves, Mr. David',
 'Panula, Mr. Ernesti Arvid',
 'Persson, Mr. Ernst Ulrik',
 'Graham, Mrs. William Thompson Edith Junkins',
 'Bissette, Miss. Amelia',
 'Cairns, Mr. Alexander',
 'Tornquist, Mr. William Henry',
 'Mellinger, Mrs. Elizabeth Anne Maidment',
 'Natsch, Mr. Charles H',
 'Healy, Miss. Hanora "Nora"',
 'Andrews, Miss. Kornelia Theodosia',
 'Lindblom, Miss. Augusta Charlotta',
 'Parkes, Mr. Francis "Frank"',
 'Rice, Master. Eric',
 'Abbott, Mrs. Stanton Rosa Hunt',
 'Duane, Mr. Frank',
 'Olsson, Mr. Nils Johan Goransson',
 'de Pelsmaeker, Mr. Alfons',
 'Dorking, Mr. Edward Arthur',
 'Smith, Mr. Richard William',
 'Stankovic, Mr. Ivan',
 'de Mulder, Mr. Theodore',
 'Naidenoff, Mr. Penko',
 'Hosono, Mr. Masabumi',
 'Connolly, Miss. Kate',
 'Barber, Miss. Ellen "Nellie"',
 'Bishop, Mrs. Dickinson H Helen Walton',
 'Levy, Mr. Rene Jacques',
 'Haas, Miss. Aloisia',
 'Mineff, Mr. Ivan',
 'Lewy, Mr. Ervin G',
 'Hanna, Mr. Mansour',
 'Allison, Miss. Helen Loraine',
 'Saalfeld, Mr. Adolphe',
 'Baxter, Mrs. James Helene DeLaudeniere Chaput',
 'Kelly, Miss. Anna Katherine "Annie Kate"',
 'McCoy, Mr. Bernard',
 'Johnson, Mr. William Cahoone Jr',
 'Keane, Miss. Nora A',
 'Williams, Mr. Howard Hugh "Harry"',
 'Allison, Master. Hudson Trevor',
 'Fleming, Miss. Margaret',
 'Penasco y Castellana, Mrs. Victor de Satode Maria Josefa Perez de Soto y Vallejo',
 'Abelson, Mr. Samuel',
 'Francatelli, Miss. Laura Mabel',
 'Hays, Miss. Margaret Bechstein',
 'Ryerson, Miss. Emily Borie',
 'Lahtinen, Mrs. William Anna Sylfven',
 'Hendekovic, Mr. Ignjac',
 'Hart, Mr. Benjamin',
 'Nilsson, Miss. Helmina Josefina',
 'Kantor, Mrs. Sinai Miriam Sternin',
 'Moraweck, Dr. Ernest',
 'Wick, Miss. Mary Natalie',
 'Spedden, Mrs. Frederic Oakley Margaretta Corning Stone',
 'Dennis, Mr. Samuel',
 'Danoff, Mr. Yoto',
 'Slayter, Miss. Hilda Mary',
 'Caldwell, Mrs. Albert Francis Sylvia Mae Harbaugh',
 'Sage, Mr. George John Jr',
 'Young, Miss. Marie Grice',
 'Nysveen, Mr. Johan Hansen',
 'Ball, Mrs. Ada E Hall',
 'Goldsmith, Mrs. Frank John Emily Alice Brown',
 'Hippach, Miss. Jean Gertrude',
 'McCoy, Miss. Agnes',
 'Partner, Mr. Austen',
 'Graham, Mr. George Edward',
 'Vander Planke, Mr. Leo Edmondus',
 'Frauenthal, Mrs. Henry William Clara Heinsheimer',
 'Denkoff, Mr. Mitto',
 'Pears, Mr. Thomas Clinton',
 'Burns, Miss. Elizabeth Margaret',
 'Dahl, Mr. Karl Edwart',
 'Blackwell, Mr. Stephen Weart',
 'Navratil, Master. Edmond Roger',
 'Fortune, Miss. Alice Elizabeth',
 'Collander, Mr. Erik Gustaf',
 'Sedgwick, Mr. Charles Frederick Waddington',
 'Fox, Mr. Stanley Hubert',
 'Brown, Miss. Amelia "Mildred"',
 'Smith, Miss. Marion Elsie',
 'Davison, Mrs. Thomas Henry Mary E Finck',
 'Coutts, Master. William Loch "William"',
 'Dimic, Mr. Jovan',
 'Odahl, Mr. Nils Martin',
 'Williams-Lambert, Mr. Fletcher Fellows',
 'Elias, Mr. Tannous',
 'Arnold-Franchi, Mr. Josef',
 'Yousif, Mr. Wazli',
 'Vanden Steen, Mr. Leo Peter',
 'Bowerman, Miss. Elsie Edith',
 'Funk, Miss. Annie Clemmer',
 'McGovern, Miss. Mary',
 'Mockler, Miss. Helen Mary "Ellie"',
 'Skoog, Mr. Wilhelm',
 'del Carlo, Mr. Sebastiano',
 'Barbara, Mrs. Catherine David',
 'Asim, Mr. Adola',
 "O'Brien, Mr. Thomas",
 'Adahl, Mr. Mauritz Nils Martin',
 'Warren, Mrs. Frank Manley Anna Sophia Atkinson',
 'Moussa, Mrs. Mantoura Boulos',
 'Jermyn, Miss. Annie',
 'Aubart, Mme. Leontine Pauline',
 'Harder, Mr. George Achilles',
 'Wiklund, Mr. Jakob Alfred',
 'Beavan, Mr. William Thomas',
 'Ringhini, Mr. Sante',
 'Palsson, Miss. Stina Viola',
 'Meyer, Mrs. Edgar Joseph Leila Saks',
 'Landergren, Miss. Aurora Adelia',
 'Widener, Mr. Harry Elkins',
 'Betros, Mr. Tannous',
 'Gustafsson, Mr. Karl Gideon',
 'Bidois, Miss. Rosalie',
 'Nakid, Miss. Maria "Mary"',
 'Tikkanen, Mr. Juho',
 'Holverson, Mrs. Alexander Oskar Mary Aline Towner',
 'Plotcharsky, Mr. Vasil',
 'Davies, Mr. Charles Henry',
 'Goodwin, Master. Sidney Leonard',
 'Buss, Miss. Kate',
 'Sadlier, Mr. Matthew',
 'Lehmann, Miss. Bertha',
 'Carter, Mr. William Ernest',
 'Jansson, Mr. Carl Olof',
 'Gustafsson, Mr. Johan Birger',
 'Newell, Miss. Marjorie',
 'Sandstrom, Mrs. Hjalmar Agnes Charlotta Bengtsson',
 'Johansson, Mr. Erik',
 'Olsson, Miss. Elina',
 'McKane, Mr. Peter David',
 'Pain, Dr. Alfred',
 'Trout, Mrs. William H Jessie L',
 'Niskanen, Mr. Juha',
 'Adams, Mr. John',
 'Jussila, Miss. Mari Aina',
 'Hakkarainen, Mr. Pekka Pietari',
 'Oreskovic, Miss. Marija',
 'Gale, Mr. Shadrach',
 'Widegren, Mr. Carl/Charles Peter',
 'Richards, Master. William Rowe',
 'Birkeland, Mr. Hans Martin Monsen',
 'Lefebre, Miss. Ida',
 'Sdycoff, Mr. Todor',
 'Hart, Mr. Henry',
 'Minahan, Miss. Daisy E',
 'Cunningham, Mr. Alfred Fleming',
 'Sundman, Mr. Johan Julian',
 'Meek, Mrs. Thomas Annie Louise Rowley',
 'Drew, Mrs. James Vivian Lulu Thorne Christian',
 'Silven, Miss. Lyyli Karoliina',
 'Matthews, Mr. William John',
 'Van Impe, Miss. Catharina',
 'Gheorgheff, Mr. Stanio',
 'Charters, Mr. David',
 'Zimmerman, Mr. Leo',
 'Danbom, Mrs. Ernst Gilbert Anna Sigrid Maria Brogren',
 'Rosblom, Mr. Viktor Richard',
 'Wiseman, Mr. Phillippe',
 'Clarke, Mrs. Charles V Ada Maria Winfield',
 'Phillips, Miss. Kate Florence "Mrs Kate Louise Phillips Marshall"',
 'Flynn, Mr. James',
 'Pickard, Mr. Berk Berk Trembisky',
 'Bjornstrom-Steffansson, Mr. Mauritz Hakan',
 'Thorneycroft, Mrs. Percival Florence Kate White',
 'Louch, Mrs. Charles Alexander Alice Adelaide Slow',
 'Kallio, Mr. Nikolai Erland',
 'Silvey, Mr. William Baird',
 'Carter, Miss. Lucile Polk',
 'Ford, Miss. Doolina Margaret "Daisy"',
 'Richards, Mrs. Sidney Emily Hocking',
 'Fortune, Mr. Mark',
 'Kvillner, Mr. Johan Henrik Johannesson',
 'Hart, Mrs. Benjamin Esther Ada Bloomfield',
 'Hampe, Mr. Leon',
 'Petterson, Mr. Johan Emil',
 'Reynaldo, Ms. Encarnacion',
 'Johannesen-Bratthammer, Mr. Bernt',
 'Dodge, Master. Washington',
 'Mellinger, Miss. Madeleine Violet',
 'Seward, Mr. Frederic Kimber',
 'Baclini, Miss. Marie Catherine',
 'Peuchen, Major. Arthur Godfrey',
 'West, Mr. Edwy Arthur',
 'Hagland, Mr. Ingvald Olai Olsen',
 'Foreman, Mr. Benjamin Laventall',
 'Goldenberg, Mr. Samuel L',
 'Peduzzi, Mr. Joseph',
 'Jalsevac, Mr. Ivan',
 'Millet, Mr. Francis Davis',
 'Kenyon, Mrs. Frederick R Marion',
 'Toomey, Miss. Ellen',
 "O'Connor, Mr. Maurice",
 'Anderson, Mr. Harry',
 'Morley, Mr. William',
 'Gee, Mr. Arthur H',
 'Milling, Mr. Jacob Christian',
 'Maisner, Mr. Simon',
 'Goncalves, Mr. Manuel Estanslas',
 'Campbell, Mr. William',
 'Smart, Mr. John Montgomery',
 'Scanlan, Mr. James',
 'Baclini, Miss. Helene Barbara',
 'Keefe, Mr. Arthur',
 'Cacic, Mr. Luka',
 'West, Mrs. Edwy Arthur Ada Mary Worth',
 'Jerwan, Mrs. Amin S Marie Marthe Thuillard',
 'Strandberg, Miss. Ida Sofia',
 'Clifford, Mr. George Quincy',
 'Renouf, Mr. Peter Henry',
 'Braund, Mr. Lewis Richard',
 'Karlsson, Mr. Nils August',
 'Hirvonen, Miss. Hildur E',
 'Goodwin, Master. Harold Victor',
 'Frost, Mr. Anthony Wood "Archie"',
 'Rouse, Mr. Richard Henry',
 'Turkula, Mrs. Hedwig',
 'Bishop, Mr. Dickinson H',
 'Lefebre, Miss. Jeannie',
 'Hoyt, Mrs. Frederick Maxfield Jane Anne Forby',
 'Kent, Mr. Edward Austin',
 'Somerton, Mr. Francis William',
 'Coutts, Master. Eden Leslie "Neville"',
 'Hagland, Mr. Konrad Mathias Reiersen',
 'Windelov, Mr. Einar',
 'Molson, Mr. Harry Markland',
 'Artagaveytia, Mr. Ramon',
 'Stanley, Mr. Edward Roland',
 'Yousseff, Mr. Gerious',
 'Eustis, Miss. Elizabeth Mussey',
 'Shellard, Mr. Frederick William',
 'Allison, Mrs. Hudson J C Bessie Waldo Daniels',
 'Svensson, Mr. Olof',
 'Calic, Mr. Petar',
 'Canavan, Miss. Mary',
 "O'Sullivan, Miss. Bridget Mary",
 'Laitinen, Miss. Kristina Sofia',
 'Maioni, Miss. Roberta',
 'Penasco y Castellana, Mr. Victor de Satode',
 'Quick, Mrs. Frederick Charles Jane Richards',
 'Bradley, Mr. George "George Arthur Brayton"',
 'Olsen, Mr. Henry Margido',
 'Lang, Mr. Fang',
 'Daly, Mr. Eugene Patrick',
 'Webber, Mr. James',
 'McGough, Mr. James Robert',
 'Rothschild, Mrs. Martin Elizabeth L. Barrett',
 'Coleff, Mr. Satio',
 'Walker, Mr. William Anderson',
 'Lemore, Mrs. Amelia Milley',
 'Ryan, Mr. Patrick',
 'Angle, Mrs. William A Florence "Mary" Agnes Hughes',
 'Pavlovic, Mr. Stefo',
 'Perreault, Miss. Anne',
 'Vovk, Mr. Janko',
 'Lahoud, Mr. Sarkis',
 'Hippach, Mrs. Louis Albert Ida Sophia Fischer',
 'Kassem, Mr. Fared',
 'Farrell, Mr. James',
 'Ridsdale, Miss. Lucy',
 'Farthing, Mr. John',
 'Salonen, Mr. Johan Werner',
 'Hocking, Mr. Richard George',
 'Quick, Miss. Phyllis May',
 'Toufik, Mr. Nakli',
 'Elias, Mr. Joseph Jr',
 'Peter, Mrs. Catherine Catherine Rizk',
 'Cacic, Miss. Marija',
 'Hart, Miss. Eva Miriam',
 'Butt, Major. Archibald Willingham',
 'LeRoy, Miss. Bertha',
 'Risien, Mr. Samuel Beard',
 'Frolicher, Miss. Hedwig Margaritha',
 'Crosby, Miss. Harriet R',
 'Andersson, Miss. Ingeborg Constanzia',
 'Andersson, Miss. Sigrid Elisabeth',
 'Beane, Mr. Edward',
 'Douglas, Mr. Walter Donald',
 'Nicholson, Mr. Arthur Ernest',
 'Beane, Mrs. Edward Ethel Clarke',
 'Padro y Manent, Mr. Julian',
 'Goldsmith, Mr. Frank John',
 'Davies, Master. John Morgan Jr',
 'Thayer, Mr. John Borland Jr',
 'Sharp, Mr. Percival James R',
 "O'Brien, Mr. Timothy",
 'Leeni, Mr. Fahim "Philip Zenni"',
 'Ohman, Miss. Velin',
 'Wright, Mr. George',
 'Duff Gordon, Lady. Lucille Christiana Sutherland "Mrs Morgan"',
 'Robbins, Mr. Victor',
 'Taussig, Mrs. Emil Tillie Mandelbaum',
 'de Messemaeker, Mrs. Guillaume Joseph Emma',
 'Morrow, Mr. Thomas Rowan',
 'Sivic, Mr. Husein',
 'Norman, Mr. Robert Douglas',
 'Simmons, Mr. John',
 'Meanwell, Miss. Marion Ogden',
 'Davies, Mr. Alfred J',
 'Stoytcheff, Mr. Ilia',
 'Palsson, Mrs. Nils Alma Cornelia Berglund',
 'Doharr, Mr. Tannous',
 'Jonsson, Mr. Carl',
 'Harris, Mr. George',
 'Appleton, Mrs. Edward Dale Charlotte Lamson',
 'Flynn, Mr. John Irwin "Irving"',
 'Kelly, Miss. Mary',
 'Rush, Mr. Alfred George John',
 'Patchett, Mr. George',
 'Garside, Miss. Ethel',
 'Silvey, Mrs. William Baird Alice Munger',
 'Caram, Mrs. Joseph Maria Elias',
 'Jussila, Mr. Eiriik',
 'Christy, Miss. Julie Rachel',
 'Thayer, Mrs. John Borland Marian Longstreth Morris',
 'Downton, Mr. William James',
 'Ross, Mr. John Hugo',
 'Paulner, Mr. Uscher',
 'Taussig, Miss. Ruth',
 'Jarvis, Mr. John Denzil',
 'Frolicher-Stehli, Mr. Maxmillian',
 'Gilinski, Mr. Eliezer',
 'Murdlin, Mr. Joseph',
 'Rintamaki, Mr. Matti',
 'Stephenson, Mrs. Walter Bertram Martha Eustis',
 'Elsbury, Mr. William James',
 'Bourke, Miss. Mary',
 'Chapman, Mr. John Henry',
 'Van Impe, Mr. Jean Baptiste',
 'Leitch, Miss. Jessie Wills',
 'Johnson, Mr. Alfred',
 'Boulos, Mr. Hanna',
 'Duff Gordon, Sir. Cosmo Edmund "Mr Morgan"',
 'Jacobsohn, Mrs. Sidney Samuel Amy Frances Christy',
 'Slabenoff, Mr. Petco',
 'Harrington, Mr. Charles H',
 'Torber, Mr. Ernst William',
 'Homer, Mr. Harry "Mr E Haven"',
 'Lindell, Mr. Edvard Bengtsson',
 'Karaic, Mr. Milan',
 'Daniel, Mr. Robert Williams',
 'Laroche, Mrs. Joseph Juliette Marie Louise Lafargue',
 'Shutes, Miss. Elizabeth W',
 'Andersson, Mrs. Anders Johan Alfrida Konstantia Brogren',
 'Jardin, Mr. Jose Neto',
 'Murphy, Miss. Margaret Jane',
 'Horgan, Mr. John',
 'Brocklebank, Mr. William Alfred',
 'Herman, Miss. Alice',
 'Danbom, Mr. Ernst Gilbert',
 'Lobb, Mrs. William Arthur Cordelia K Stanlick',
 'Becker, Miss. Marion Louise',
 'Gavey, Mr. Lawrence',
 'Yasbeck, Mr. Antoni',
 'Kimball, Mr. Edwin Nelson Jr',
 'Nakid, Mr. Sahid',
 'Hansen, Mr. Henry Damsgaard',
 'Bowen, Mr. David John "Dai"',
 'Sutton, Mr. Frederick',
 'Kirkland, Rev. Charles Leonard',
 'Longley, Miss. Gretchen Fiske',
 'Bostandyeff, Mr. Guentcho',
 "O'Connell, Mr. Patrick D",

In [62]:
name2=data['승객이름'].copy()

In [63]:
name2

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: 승객이름, Length: 891, dtype: object

In [64]:
data['승객이름']=result

In [66]:
data['승객이름']

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley Florence Briggs Thayer
2                                 Heikkinen, Miss. Laina
3             Futrelle, Mrs. Jacques Heath Lily May Peel
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: 승객이름, Length: 891, dtype: object

In [67]:
data['승객이름']=name2

In [69]:
data['승객이름'].apply(lambda x: x.replace('(','').replace(')',''))

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley Florence Briggs Thayer
2                                 Heikkinen, Miss. Laina
3             Futrelle, Mrs. Jacques Heath Lily May Peel
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: 승객이름, Length: 891, dtype: object

In [73]:
data['승객이름']=name2
data

,승객번호,선실등급,승차권번호,승객이름,성별,나이,형제자매수,부모자식수,승차권금액,좌석번호,정박지,생존여부,가족수
0,1,3,A/5 21171,"Braund, Mr. Owen Harris",male,22.0,1,0,7.2500,NaN,S,0,1
1,2,1,PC 17599,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,71.2833,C85,C,1,1
2,3,3,STON/O2. 3101282,"Heikkinen, Miss. Laina",female,26.0,0,0,7.9250,NaN,S,1,0
3,4,1,113803,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,53.1000,C123,S,1,1
4,5,3,373450,"Allen, Mr. William Henry",male,35.0,0,0,8.0500,NaN,S,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,2,211536,"Montvila, Rev. Juozas",male,27.0,0,0,13.0000,NaN,S,0,0
887,888,1,112053,"Graham, Miss. Margaret Edith",female,19.0,0,0,30.0000,B42,S,1,0
888,889,3,W./C. 6607,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,23.4500,NaN,S,0,3
889,890,1,111369,"Behr, Mr. Karl Howell",male,26.0,0,0,30.0000,C148,C,1,0
890,891,3,370376,"Dooley, Mr. Patrick",male,32.0,0,0,7.7500,NaN,Q,0,0

In [74]:
data['승객이름'].str.replace('(','').str.replace(')','')

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley Florence Briggs Thayer
2                                 Heikkinen, Miss. Laina
3             Futrelle, Mrs. Jacques Heath Lily May Peel
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: 승객이름, Length: 891, dtype: object

* 승객이름 컬럼에서 이름만 추출하기 .str.split()

In [76]:
data['승객이름'].str.split(", ")
data['승객이름']

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: 승객이름, Length: 891, dtype: object

# groupby
* 데이터프레임[['컬럼1','컬럼2'].groupby("기준칼럼").집합연산함수(mean,max,min,count,value_counts)

In [77]:
data[['성별','나이']].groupby("성별").mean()

               나이
성별
female  27.915709
male    30.726645

In [78]:
data[['성별','생존여부']].groupby("성별").value_counts()

성별      생존여부
female  1       233
        0        81
male    0       468
        1       109
Name: count, dtype: int64

In [79]:
data[['선실등급','생존여부']].groupby("선실등급").value_counts(sort=False)

선실등급  생존여부
1     0        80
      1       136
2     0        97
      1        87
3     0       372
      1       119
Name: count, dtype: int64

성별별, 선신등급별 생존여부

In [80]:
data[['성별','선실등급','생존여부']].groupby(['성별','선실등급']).value_counts(sort=False)

성별      선실등급  생존여부
female  1     0         3
              1        91
        2     0         6
              1        70
        3     0        72
              1        72
male    1     0        77
              1        45
        2     0        91
              1        17
        3     0       300
              1        47
Name: count, dtype: int64